var threeSelectData={
    "北京市": {
        "val": 1,
        "items": {
            "北京市": {
                "val": 2,
                "items": {
                    "东城区": 3,
                    "西城区": 4,
                    "朝阳区": 5,
                    "丰台区": 6,
                    "石景山区": 7,
                    "海淀区": 8,
                    "门头沟区": 9,
                    "房山区": 10,
                    "通州区": 11,
                    "顺义区": 12,
                    "昌平区": 13,
                    "大兴区": 14,
                    "怀柔区": 15,
                    "平谷区": 16,
                    "密云县": 17,
                    "延庆县": 18
                }
            }
        }
    },
    "天津市": {
        "val": 19,
        "items": {
            "天津市": {
                "val": 20,
                "items": {
                    "和平区": 21,
                    "河东区": 22,
                    "河西区": 23,
                    "南开区": 24,
                    "河北区": 25,
                    "红桥区": 26,
                    "东丽区": 27,
                    "西青区": 28,
                    "津南区": 29,
                    "北辰区": 30,
                    "武清区": 31,
                    "宝坻区": 32,
                    "滨海新区": 33,
                    "宁河县": 34,
                    "静海县": 35,
                    "蓟县": 36
                }
            }
        }
    },
    "河北省": {
        "val": 37,
        "items": {
            "石家庄市": {
                "val": 38,
                "items": {
                    "长安区": 39,
                    "桥西区": 40,
                    "新华区": 41,
                    "井陉矿区": 42,
                    "裕华区": 43,
                    "藁城区": 44,
                    "鹿泉区": 45,
                    "栾城区": 46,
                    "井陉县": 47,
                    "正定县": 48,
                    "行唐县": 49,
                    "灵寿县": 50,
                    "高邑县": 51,
                    "深泽县": 52,
                    "赞皇县": 53,
                    "无极县": 54,
                    "平山县": 55,
                    "元氏县": 56,
                    "赵县": 57,
                    "辛集市": 58,
                    "晋州市": 59,
                    "新乐市": 60
                }
            },
            "唐山市": {
                "val": 61,
                "items": {
                    "路南区": 62,
                    "路北区": 63,
                    "古冶区": 64,
                    "开平区": 65,
                    "丰南区": 66,
                    "丰润区": 67,
                    "曹妃甸区": 68,
                    "滦县": 69,
                    "滦南县": 70,
                    "乐亭县": 71,
                    "迁西县": 72,
                    "玉田县": 73,
                    "遵化市": 74,
                    "迁安市": 75
                }
            },
            "秦皇岛市": {
                "val": 76,
                "items": {
                    "海港区": 77,
                    "山海关区": 78,
                    "北戴河区": 79,
                    "青龙满族自治县": 80,
                    "昌黎县": 81,
                    "抚宁县": 82,
                    "卢龙县": 83
                }
            },
            "邯郸市": {
                "val": 84,
                "items": {
                    "邯山区": 85,
                    "丛台区": 86,
                    "复兴区": 87,
                    "峰峰矿区": 88,
                    "邯郸县": 89,
                    "临漳县": 90,
                    "成安县": 91,
                    "大名县": 92,
                    "涉县": 93,
                    "磁县": 94,
                    "肥乡县": 95,
                    "永年县": 96,
                    "邱县": 97,
                    "鸡泽县": 98,
                    "广平县": 99,
                    "馆陶县": 100,
                    "魏县": 101,
                    "曲周县": 102,
                    "武安市": 103
                }
            },
            "邢台市": {
                "val": 104,
                "items": {
                    "桥东区": 105,
                    "桥西区": 106,
                    "邢台县": 107,
                    "临城县": 108,
                    "内丘县": 109,
                    "柏乡县": 110,
                    "隆尧县": 111,
                    "任县": 112,
                    "南和县": 113,
                    "宁晋县": 114,
                    "巨鹿县": 115,
                    "新河县": 116,
                    "广宗县": 117,
                    "平乡县": 118,
                    "威县": 119,
                    "清河县": 120,
                    "临西县": 121,
                    "南宫市": 122,
                    "沙河市": 123
                }
            },
            "保定市": {
                "val": 124,
                "items": {
                    "新市区": 125,
                    "北市区": 126,
                    "南市区": 127,
                    "满城县": 128,
                    "清苑县": 129,
                    "涞水县": 130,
                    "阜平县": 131,
                    "徐水县": 132,
                    "定兴县": 133,
                    "唐县": 134,
                    "高阳县": 135,
                    "容城县": 136,
                    "涞源县": 137,
                    "望都县": 138,
                    "安新县": 139,
                    "易县": 140,
                    "曲阳县": 141,
                    "蠡县": 142,
                    "顺平县": 143,
                    "博野县": 144,
                    "雄县": 145,
                    "涿州市": 146,
                    "定州市": 147,
                    "安国市": 148,
                    "高碑店市": 149
                }
            },
            "张家口市": {
                "val": 150,
                "items": {
                    "桥东区": 151,
                    "桥西区": 152,
                    "宣化区": 153,
                    "下花园区": 154,
                    "宣化县": 155,
                    "张北县": 156,
                    "康保县": 157,
                    "沽源县": 158,
                    "尚义县": 159,
                    "蔚县": 160,
                    "阳原县": 161,
                    "怀安县": 162,
                    "万全县": 163,
                    "怀来县": 164,
                    "涿鹿县": 165,
                    "赤城县": 166,
                    "崇礼县": 167
                }
            },
            "承德市": {
                "val": 168,
                "items": {
                    "双桥区": 169,
                    "双滦区": 170,
                    "鹰手营子矿区": 171,
                    "承德县": 172,
                    "兴隆县": 173,
                    "平泉县": 174,
                    "滦平县": 175,
                    "隆化县": 176,
                    "丰宁满族自治县": 177,
                    "宽城满族自治县": 178,
                    "围场满族蒙古族自治县": 179
                }
            },
            "沧州市": {
                "val": 180,
                "items": {
                    "新华区": 181,
                    "运河区": 182,
                    "沧县": 183,
                    "青县": 184,
                    "东光县": 185,
                    "海兴县": 186,
                    "盐山县": 187,
                    "肃宁县": 188,
                    "南皮县": 189,
                    "吴桥县": 190,
                    "献县": 191,
                    "孟村回族自治县": 192,
                    "泊头市": 193,
                    "任丘市": 194,
                    "黄骅市": 195,
                    "河间市": 196
                }
            },
            "廊坊市": {
                "val": 197,
                "items": {
                    "安次区": 198,
                    "广阳区": 199,
                    "固安县": 200,
                    "永清县": 201,
                    "香河县": 202,
                    "大城县": 203,
                    "文安县": 204,
                    "大厂回族自治县": 205,
                    "霸州市": 206,
                    "三河市": 207
                }
            },
            "衡水市": {
                "val": 208,
                "items": {
                    "桃城区": 209,
                    "枣强县": 210,
                    "武邑县": 211,
                    "武强县": 212,
                    "饶阳县": 213,
                    "安平县": 214,
                    "故城县": 215,
                    "景县": 216,
                    "阜城县": 217,
                    "冀州市": 218,
                    "深州市": 219
                }
            }
        }
    },
    "山西省": {
        "val": 220,
        "items": {
            "太原市": {
                "val": 221,
                "items": {
                    "小店区": 222,
                    "迎泽区": 223,
                    "杏花岭区": 224,
                    "尖草坪区": 225,
                    "万柏林区": 226,
                    "晋源区": 227,
                    "清徐县": 228,
                    "阳曲县": 229,
                    "娄烦县": 230,
                    "古交市": 231
                }
            },
            "大同市": {
                "val": 232,
                "items": {
                    "城区": 233,
                    "矿区": 234,
                    "南郊区": 235,
                    "新荣区": 236,
                    "阳高县": 237,
                    "天镇县": 238,
                    "广灵县": 239,
                    "灵丘县": 240,
                    "浑源县": 241,
                    "左云县": 242,
                    "大同县": 243
                }
            },
            "阳泉市": {
                "val": 244,
                "items": {
                    "城区": 245,
                    "矿区": 246,
                    "郊区": 247,
                    "平定县": 248,
                    "盂县": 249
                }
            },
            "长治市": {
                "val": 250,
                "items": {
                    "城区": 251,
                    "郊区": 252,
                    "长治县": 253,
                    "襄垣县": 254,
                    "屯留县": 255,
                    "平顺县": 256,
                    "黎城县": 257,
                    "壶关县": 258,
                    "长子县": 259,
                    "武乡县": 260,
                    "沁县": 261,
                    "沁源县": 262,
                    "潞城市": 263
                }
            },
            "晋城市": {
                "val": 264,
                "items": {
                    "城区": 265,
                    "沁水县": 266,
                    "阳城县": 267,
                    "陵川县": 268,
                    "泽州县": 269,
                    "高平市": 270
                }
            },
            "朔州市": {
                "val": 271,
                "items": {
                    "朔城区": 272,
                    "平鲁区": 273,
                    "山阴县": 274,
                    "应县": 275,
                    "右玉县": 276,
                    "怀仁县": 277
                }
            },
            "晋中市": {
                "val": 278,
                "items": {
                    "榆次区": 279,
                    "榆社县": 280,
                    "左权县": 281,
                    "和顺县": 282,
                    "昔阳县": 283,
                    "寿阳县": 284,
                    "太谷县": 285,
                    "祁县": 286,
                    "平遥县": 287,
                    "灵石县": 288,
                    "介休市": 289
                }
            },
            "运城市": {
                "val": 290,
                "items": {
                    "盐湖区": 291,
                    "临猗县": 292,
                    "万荣县": 293,
                    "闻喜县": 294,
                    "稷山县": 295,
                    "新绛县": 296,
                    "绛县": 297,
                    "垣曲县": 298,
                    "夏县": 299,
                    "平陆县": 300,
                    "芮城县": 301,
                    "永济市": 302,
                    "河津市": 303
                }
            },
            "忻州市": {
                "val": 304,
                "items": {
                    "忻府区": 305,
                    "定襄县": 306,
                    "五台县": 307,
                    "代县": 308,
                    "繁峙县": 309,
                    "宁武县": 310,
                    "静乐县": 311,
                    "神池县": 312,
                    "五寨县": 313,
                    "岢岚县": 314,
                    "河曲县": 315,
                    "保德县": 316,
                    "偏关县": 317,
                    "原平市": 318
                }
            },
            "临汾市": {
                "val": 319,
                "items": {
                    "尧都区": 320,
                    "曲沃县": 321,
                    "翼城县": 322,
                    "襄汾县": 323,
                    "洪洞县": 324,
                    "古县": 325,
                    "安泽县": 326,
                    "浮山县": 327,
                    "吉县": 328,
                    "乡宁县": 329,
                    "大宁县": 330,
                    "隰县": 331,
                    "永和县": 332,
                    "蒲县": 333,
                    "汾西县": 334,
                    "侯马市": 335,
                    "霍州市": 336
                }
            },
            "吕梁市": {
                "val": 337,
                "items": {
                    "离石区": 338,
                    "文水县": 339,
                    "交城县": 340,
                    "兴县": 341,
                    "临县": 342,
                    "柳林县": 343,
                    "石楼县": 344,
                    "岚县": 345,
                    "方山县": 346,
                    "中阳县": 347,
                    "交口县": 348,
                    "孝义市": 349,
                    "汾阳市": 350
                }
            }
        }
    },
    "内蒙古自治区": {
        "val": 351,
        "items": {
            "呼和浩特市": {
                "val": 352,
                "items": {
                    "新城区": 353,
                    "回民区": 354,
                    "玉泉区": 355,
                    "赛罕区": 356,
                    "土默特左旗": 357,
                    "托克托县": 358,
                    "和林格尔县": 359,
                    "清水河县": 360,
                    "武川县": 361
                }
            },
            "包头市": {
                "val": 362,
                "items": {
                    "东河区": 363,
                    "昆都仑区": 364,
                    "青山区": 365,
                    "石拐区": 366,
                    "白云鄂博矿区": 367,
                    "九原区": 368,
                    "土默特右旗": 369,
                    "固阳县": 370,
                    "达尔罕茂明安联合旗": 371
                }
            },
            "乌海市": {
                "val": 372,
                "items": {
                    "海勃湾区": 373,
                    "海南区": 374,
                    "乌达区": 375
                }
            },
            "赤峰市": {
                "val": 376,
                "items": {
                    "红山区": 377,
                    "元宝山区": 378,
                    "松山区": 379,
                    "阿鲁科尔沁旗": 380,
                    "巴林左旗": 381,
                    "巴林右旗": 382,
                    "林西县": 383,
                    "克什克腾旗": 384,
                    "翁牛特旗": 385,
                    "喀喇沁旗": 386,
                    "宁城县": 387,
                    "敖汉旗": 388
                }
            },
            "通辽市": {
                "val": 389,
                "items": {
                    "科尔沁区": 390,
                    "科尔沁左翼中旗": 391,
                    "科尔沁左翼后旗": 392,
                    "开鲁县": 393,
                    "库伦旗": 394,
                    "奈曼旗": 395,
                    "扎鲁特旗": 396,
                    "霍林郭勒市": 397
                }
            },
            "鄂尔多斯市": {
                "val": 398,
                "items": {
                    "东胜区": 399,
                    "达拉特旗": 400,
                    "准格尔旗": 401,
                    "鄂托克前旗": 402,
                    "鄂托克旗": 403,
                    "杭锦旗": 404,
                    "乌审旗": 405,
                    "伊金霍洛旗": 406
                }
            },
            "呼伦贝尔市": {
                "val": 407,
                "items": {
                    "海拉尔区": 408,
                    "扎赉诺尔区": 409,
                    "阿荣旗": 410,
                    "莫力达瓦达斡尔族自治旗": 411,
                    "鄂伦春自治旗": 412,
                    "鄂温克族自治旗": 413,
                    "陈巴尔虎旗": 414,
                    "新巴尔虎左旗": 415,
                    "新巴尔虎右旗": 416,
                    "满洲里市": 417,
                    "牙克石市": 418,
                    "扎兰屯市": 419,
                    "额尔古纳市": 420,
                    "根河市": 421
                }
            },
            "巴彦淖尔市": {
                "val": 422,
                "items": {
                    "临河区": 423,
                    "五原县": 424,
                    "磴口县": 425,
                    "乌拉特前旗": 426,
                    "乌拉特中旗": 427,
                    "乌拉特后旗": 428,
                    "杭锦后旗": 429
                }
            },
            "乌兰察布市": {
                "val": 430,
                "items": {
                    "集宁区": 431,
                    "卓资县": 432,
                    "化德县": 433,
                    "商都县": 434,
                    "兴和县": 435,
                    "凉城县": 436,
                    "察哈尔右翼前旗": 437,
                    "察哈尔右翼中旗": 438,
                    "察哈尔右翼后旗": 439,
                    "四子王旗": 440,
                    "丰镇市": 441
                }
            },
            "兴安盟": {
                "val": 442,
                "items": {
                    "乌兰浩特市": 443,
                    "阿尔山市": 444,
                    "科尔沁右翼前旗": 445,
                    "科尔沁右翼中旗": 446,
                    "扎赉特旗": 447,
                    "突泉县": 448
                }
            },
            "锡林郭勒盟": {
                "val": 449,
                "items": {
                    "二连浩特市": 450,
                    "锡林浩特市": 451,
                    "阿巴嘎旗": 452,
                    "苏尼特左旗": 453,
                    "苏尼特右旗": 454,
                    "东乌珠穆沁旗": 455,
                    "西乌珠穆沁旗": 456,
                    "太仆寺旗": 457,
                    "镶黄旗": 458,
                    "正镶白旗": 459,
                    "正蓝旗": 460,
                    "多伦县": 461
                }
            },
            "阿拉善盟": {
                "val": 462,
                "items": {
                    "阿拉善左旗": 463,
                    "阿拉善右旗": 464,
                    "额济纳旗": 465
                }
            }
        }
    },
    "辽宁省": {
        "val": 466,
        "items": {
            "沈阳市": {
                "val": 467,
                "items": {
                    "和平区": 468,
                    "沈河区": 469,
                    "大东区": 470,
                    "皇姑区": 471,
                    "铁西区": 472,
                    "苏家屯区": 473,
                    "浑南区": 474,
                    "沈北新区": 475,
                    "于洪区": 476,
                    "辽中县": 477,
                    "康平县": 478,
                    "法库县": 479,
                    "新民市": 480
                }
            },
            "大连市": {
                "val": 481,
                "items": {
                    "中山区": 482,
                    "西岗区": 483,
                    "沙河口区": 484,
                    "甘井子区": 485,
                    "旅顺口区": 486,
                    "金州区": 487,
                    "长海县": 488,
                    "瓦房店市": 489,
                    "普兰店市": 490,
                    "庄河市": 491
                }
            },
            "鞍山市": {
                "val": 492,
                "items": {
                    "铁东区": 493,
                    "铁西区": 494,
                    "立山区": 495,
                    "千山区": 496,
                    "台安县": 497,
                    "岫岩满族自治县": 498,
                    "海城市": 499
                }
            },
            "抚顺市": {
                "val": 500,
                "items": {
                    "新抚区": 501,
                    "东洲区": 502,
                    "望花区": 503,
                    "顺城区": 504,
                    "抚顺县": 505,
                    "新宾满族自治县": 506,
                    "清原满族自治县": 507
                }
            },
            "本溪市": {
                "val": 508,
                "items": {
                    "平山区": 509,
                    "溪湖区": 510,
                    "明山区": 511,
                    "南芬区": 512,
                    "本溪满族自治县": 513,
                    "桓仁满族自治县": 514
                }
            },
            "丹东市": {
                "val": 515,
                "items": {
                    "元宝区": 516,
                    "振兴区": 517,
                    "振安区": 518,
                    "宽甸满族自治县": 519,
                    "东港市": 520,
                    "凤城市": 521
                }
            },
            "锦州市": {
                "val": 522,
                "items": {
                    "古塔区": 523,
                    "凌河区": 524,
                    "太和区": 525,
                    "黑山县": 526,
                    "义县": 527,
                    "凌海市": 528,
                    "北镇市": 529
                }
            },
            "营口市": {
                "val": 530,
                "items": {
                    "站前区": 531,
                    "西市区": 532,
                    "鲅鱼圈区": 533,
                    "老边区": 534,
                    "盖州市": 535,
                    "大石桥市": 536
                }
            },
            "阜新市": {
                "val": 537,
                "items": {
                    "海州区": 538,
                    "新邱区": 539,
                    "太平区": 540,
                    "清河门区": 541,
                    "细河区": 542,
                    "阜新蒙古族自治县": 543,
                    "彰武县": 544
                }
            },
            "辽阳市": {
                "val": 545,
                "items": {
                    "白塔区": 546,
                    "文圣区": 547,
                    "宏伟区": 548,
                    "弓长岭区": 549,
                    "太子河区": 550,
                    "辽阳县": 551,
                    "灯塔市": 552
                }
            },
            "盘锦市": {
                "val": 553,
                "items": {
                    "双台子区": 554,
                    "兴隆台区": 555,
                    "大洼县": 556,
                    "盘山县": 557
                }
            },
            "铁岭市": {
                "val": 558,
                "items": {
                    "银州区": 559,
                    "清河区": 560,
                    "铁岭县": 561,
                    "西丰县": 562,
                    "昌图县": 563,
                    "调兵山市": 564,
                    "开原市": 565
                }
            },
            "朝阳市": {
                "val": 566,
                "items": {
                    "双塔区": 567,
                    "龙城区": 568,
                    "朝阳县": 569,
                    "建平县": 570,
                    "喀喇沁左翼蒙古族自治县": 571,
                    "北票市": 572,
                    "凌源市": 573
                }
            },
            "葫芦岛市": {
                "val": 574,
                "items": {
                    "连山区": 575,
                    "龙港区": 576,
                    "南票区": 577,
                    "绥中县": 578,
                    "建昌县": 579,
                    "兴城市": 580
                }
            },
            "金普新区": {
                "val": 581,
                "items": {
                    "金州新区": 582,
                    "普湾新区": 583,
                    "保税区": 584
                }
            }
        }
    },
    "吉林省": {
        "val": 585,
        "items": {
            "长春市": {
                "val": 586,
                "items": {
                    "南关区": 587,
                    "宽城区": 588,
                    "朝阳区": 589,
                    "二道区": 590,
                    "绿园区": 591,
                    "双阳区": 592,
                    "九台区": 593,
                    "农安县": 594,
                    "榆树市": 595,
                    "德惠市": 596
                }
            },
            "吉林市": {
                "val": 597,
                "items": {
                    "昌邑区": 598,
                    "龙潭区": 599,
                    "船营区": 600,
                    "丰满区": 601,
                    "永吉县": 602,
                    "蛟河市": 603,
                    "桦甸市": 604,
                    "舒兰市": 605,
                    "磐石市": 606
                }
            },
            "四平市": {
                "val": 607,
                "items": {
                    "铁西区": 608,
                    "铁东区": 609,
                    "梨树县": 610,
                    "伊通满族自治县": 611,
                    "公主岭市": 612,
                    "双辽市": 613
                }
            },
            "辽源市": {
                "val": 614,
                "items": {
                    "龙山区": 615,
                    "西安区": 616,
                    "东丰县": 617,
                    "东辽县": 618
                }
            },
            "通化市": {
                "val": 619,
                "items": {
                    "东昌区": 620,
                    "二道江区": 621,
                    "通化县": 622,
                    "辉南县": 623,
                    "柳河县": 624,
                    "梅河口市": 625,
                    "集安市": 626
                }
            },
            "白山市": {
                "val": 627,
                "items": {
                    "浑江区": 628,
                    "江源区": 629,
                    "抚松县": 630,
                    "靖宇县": 631,
                    "长白朝鲜族自治县": 632,
                    "临江市": 633
                }
            },
            "松原市": {
                "val": 634,
                "items": {
                    "宁江区": 635,
                    "前郭尔罗斯蒙古族自治县": 636,
                    "长岭县": 637,
                    "乾安县": 638,
                    "扶余市": 639
                }
            },
            "白城市": {
                "val": 640,
                "items": {
                    "洮北区": 641,
                    "镇赉县": 642,
                    "通榆县": 643,
                    "洮南市": 644,
                    "大安市": 645
                }
            },
            "延边朝鲜族自治州": {
                "val": 646,
                "items": {
                    "延吉市": 647,
                    "图们市": 648,
                    "敦化市": 649,
                    "珲春市": 650,
                    "龙井市": 651,
                    "和龙市": 652,
                    "汪清县": 653,
                    "安图县": 654
                }
            }
        }
    },
    "黑龙江省": {
        "val": 655,
        "items": {
            "哈尔滨市": {
                "val": 656,
                "items": {
                    "道里区": 657,
                    "南岗区": 658,
                    "道外区": 659,
                    "平房区": 660,
                    "松北区": 661,
                    "香坊区": 662,
                    "呼兰区": 663,
                    "阿城区": 664,
                    "双城区": 665,
                    "依兰县": 666,
                    "方正县": 667,
                    "宾县": 668,
                    "巴彦县": 669,
                    "木兰县": 670,
                    "通河县": 671,
                    "延寿县": 672,
                    "尚志市": 673,
                    "五常市": 674
                }
            },
            "齐齐哈尔市": {
                "val": 675,
                "items": {
                    "龙沙区": 676,
                    "建华区": 677,
                    "铁锋区": 678,
                    "昂昂溪区": 679,
                    "富拉尔基区": 680,
                    "碾子山区": 681,
                    "梅里斯达斡尔族区": 682,
                    "龙江县": 683,
                    "依安县": 684,
                    "泰来县": 685,
                    "甘南县": 686,
                    "富裕县": 687,
                    "克山县": 688,
                    "克东县": 689,
                    "拜泉县": 690,
                    "讷河市": 691
                }
            },
            "鸡西市": {
                "val": 692,
                "items": {
                    "鸡冠区": 693,
                    "恒山区": 694,
                    "滴道区": 695,
                    "梨树区": 696,
                    "城子河区": 697,
                    "麻山区": 698,
                    "鸡东县": 699,
                    "虎林市": 700,
                    "密山市": 701
                }
            },
            "鹤岗市": {
                "val": 702,
                "items": {
                    "向阳区": 703,
                    "工农区": 704,
                    "南山区": 705,
                    "兴安区": 706,
                    "东山区": 707,
                    "兴山区": 708,
                    "萝北县": 709,
                    "绥滨县": 710
                }
            },
            "双鸭山市": {
                "val": 711,
                "items": {
                    "尖山区": 712,
                    "岭东区": 713,
                    "四方台区": 714,
                    "宝山区": 715,
                    "集贤县": 716,
                    "友谊县": 717,
                    "宝清县": 718,
                    "饶河县": 719
                }
            },
            "大庆市": {
                "val": 720,
                "items": {
                    "萨尔图区": 721,
                    "龙凤区": 722,
                    "让胡路区": 723,
                    "红岗区": 724,
                    "大同区": 725,
                    "肇州县": 726,
                    "肇源县": 727,
                    "林甸县": 728,
                    "杜尔伯特蒙古族自治县": 729
                }
            },
            "伊春市": {
                "val": 730,
                "items": {
                    "伊春区": 731,
                    "南岔区": 732,
                    "友好区": 733,
                    "西林区": 734,
                    "翠峦区": 735,
                    "新青区": 736,
                    "美溪区": 737,
                    "金山屯区": 738,
                    "五营区": 739,
                    "乌马河区": 740,
                    "汤旺河区": 741,
                    "带岭区": 742,
                    "乌伊岭区": 743,
                    "红星区": 744,
                    "上甘岭区": 745,
                    "嘉荫县": 746,
                    "铁力市": 747
                }
            },
            "佳木斯市": {
                "val": 748,
                "items": {
                    "向阳区": 749,
                    "前进区": 750,
                    "东风区": 751,
                    "郊区": 752,
                    "桦南县": 753,
                    "桦川县": 754,
                    "汤原县": 755,
                    "抚远县": 756,
                    "同江市": 757,
                    "富锦市": 758
                }
            },
            "七台河市": {
                "val": 759,
                "items": {
                    "新兴区": 760,
                    "桃山区": 761,
                    "茄子河区": 762,
                    "勃利县": 763
                }
            },
            "牡丹江市": {
                "val": 764,
                "items": {
                    "东安区": 765,
                    "阳明区": 766,
                    "爱民区": 767,
                    "西安区": 768,
                    "东宁县": 769,
                    "林口县": 770,
                    "绥芬河市": 771,
                    "海林市": 772,
                    "宁安市": 773,
                    "穆棱市": 774
                }
            },
            "黑河市": {
                "val": 775,
                "items": {
                    "爱辉区": 776,
                    "嫩江县": 777,
                    "逊克县": 778,
                    "孙吴县": 779,
                    "北安市": 780,
                    "五大连池市": 781
                }
            },
            "绥化市": {
                "val": 782,
                "items": {
                    "北林区": 783,
                    "望奎县": 784,
                    "兰西县": 785,
                    "青冈县": 786,
                    "庆安县": 787,
                    "明水县": 788,
                    "绥棱县": 789,
                    "安达市": 790,
                    "肇东市": 791,
                    "海伦市": 792
                }
            },
            "大兴安岭地区": {
                "val": 793,
                "items": {
                    "加格达奇区": 794,
                    "新林区": 795,
                    "松岭区": 796,
                    "呼中区": 797,
                    "呼玛县": 798,
                    "塔河县": 799,
                    "漠河县": 800
                }
            }
        }
    },
    "上海市": {
        "val": 801,
        "items": {
            "上海市": {
                "val": 802,
                "items": {
                    "黄浦区": 803,
                    "徐汇区": 804,
                    "长宁区": 805,
                    "静安区": 806,
                    "普陀区": 807,
                    "闸北区": 808,
                    "虹口区": 809,
                    "杨浦区": 810,
                    "闵行区": 811,
                    "宝山区": 812,
                    "嘉定区": 813,
                    "浦东新区": 814,
                    "金山区": 815,
                    "松江区": 816,
                    "青浦区": 817,
                    "奉贤区": 818,
                    "崇明县": 819
                }
            }
        }
    },
    "江苏省": {
        "val": 820,
        "items": {
            "南京市": {
                "val": 821,
                "items": {
                    "玄武区": 822,
                    "秦淮区": 823,
                    "建邺区": 824,
                    "鼓楼区": 825,
                    "浦口区": 826,
                    "栖霞区": 827,
                    "雨花台区": 828,
                    "江宁区": 829,
                    "六合区": 830,
                    "溧水区": 831,
                    "高淳区": 832
                }
            },
            "无锡市": {
                "val": 833,
                "items": {
                    "崇安区": 834,
                    "南长区": 835,
                    "北塘区": 836,
                    "锡山区": 837,
                    "惠山区": 838,
                    "滨湖区": 839,
                    "江阴市": 840,
                    "宜兴市": 841
                }
            },
            "徐州市": {
                "val": 842,
                "items": {
                    "鼓楼区": 843,
                    "云龙区": 844,
                    "贾汪区": 845,
                    "泉山区": 846,
                    "铜山区": 847,
                    "丰县": 848,
                    "沛县": 849,
                    "睢宁县": 850,
                    "新沂市": 851,
                    "邳州市": 852
                }
            },
            "常州市": {
                "val": 853,
                "items": {
                    "天宁区": 854,
                    "钟楼区": 855,
                    "戚墅堰区": 856,
                    "新北区": 857,
                    "武进区": 858,
                    "溧阳市": 859,
                    "金坛市": 860
                }
            },
            "苏州市": {
                "val": 861,
                "items": {
                    "虎丘区": 862,
                    "吴中区": 863,
                    "相城区": 864,
                    "姑苏区": 865,
                    "吴江区": 866,
                    "常熟市": 867,
                    "张家港市": 868,
                    "昆山市": 869,
                    "太仓市": 870
                }
            },
            "南通市": {
                "val": 871,
                "items": {
                    "崇川区": 872,
                    "港闸区": 873,
                    "通州区": 874,
                    "海安县": 875,
                    "如东县": 876,
                    "启东市": 877,
                    "如皋市": 878,
                    "海门市": 879
                }
            },
            "连云港市": {
                "val": 880,
                "items": {
                    "连云区": 881,
                    "海州区": 882,
                    "赣榆区": 883,
                    "东海县": 884,
                    "灌云县": 885,
                    "灌南县": 886
                }
            },
            "淮安市": {
                "val": 887,
                "items": {
                    "清河区": 888,
                    "淮安区": 889,
                    "淮阴区": 890,
                    "清浦区": 891,
                    "涟水县": 892,
                    "洪泽县": 893,
                    "盱眙县": 894,
                    "金湖县": 895
                }
            },
            "盐城市": {
                "val": 896,
                "items": {
                    "亭湖区": 897,
                    "盐都区": 898,
                    "响水县": 899,
                    "滨海县": 900,
                    "阜宁县": 901,
                    "射阳县": 902,
                    "建湖县": 903,
                    "东台市": 904,
                    "大丰市": 905
                }
            },
            "扬州市": {
                "val": 906,
                "items": {
                    "广陵区": 907,
                    "邗江区": 908,
                    "江都区": 909,
                    "宝应县": 910,
                    "仪征市": 911,
                    "高邮市": 912
                }
            },
            "镇江市": {
                "val": 913,
                "items": {
                    "京口区": 914,
                    "润州区": 915,
                    "丹徒区": 916,
                    "丹阳市": 917,
                    "扬中市": 918,
                    "句容市": 919
                }
            },
            "泰州市": {
                "val": 920,
                "items": {
                    "海陵区": 921,
                    "高港区": 922,
                    "姜堰区": 923,
                    "兴化市": 924,
                    "靖江市": 925,
                    "泰兴市": 926
                }
            },
            "宿迁市": {
                "val": 927,
                "items": {
                    "宿城区": 928,
                    "宿豫区": 929,
                    "沭阳县": 930,
                    "泗阳县": 931,
                    "泗洪县": 932
                }
            }
        }
    },
    "浙江省": {
        "val": 933,
        "items": {
            "杭州市": {
                "val": 934,
                "items": {
                    "上城区": 935,
                    "下城区": 936,
                    "江干区": 937,
                    "拱墅区": 938,
                    "西湖区": 939,
                    "滨江区": 940,
                    "萧山区": 941,
                    "余杭区": 942,
                    "桐庐县": 943,
                    "淳安县": 944,
                    "建德市": 945,
                    "富阳区": 946,
                    "临安市": 947
                }
            },
            "宁波市": {
                "val": 948,
                "items": {
                    "海曙区": 949,
                    "江东区": 950,
                    "江北区": 951,
                    "北仑区": 952,
                    "镇海区": 953,
                    "鄞州区": 954,
                    "象山县": 955,
                    "宁海县": 956,
                    "余姚市": 957,
                    "慈溪市": 958,
                    "奉化市": 959
                }
            },
            "温州市": {
                "val": 960,
                "items": {
                    "鹿城区": 961,
                    "龙湾区": 962,
                    "瓯海区": 963,
                    "洞头县": 964,
                    "永嘉县": 965,
                    "平阳县": 966,
                    "苍南县": 967,
                    "文成县": 968,
                    "泰顺县": 969,
                    "瑞安市": 970,
                    "乐清市": 971
                }
            },
            "嘉兴市": {
                "val": 972,
                "items": {
                    "南湖区": 973,
                    "秀洲区": 974,
                    "嘉善县": 975,
                    "海盐县": 976,
                    "海宁市": 977,
                    "平湖市": 978,
                    "桐乡市": 979
                }
            },
            "湖州市": {
                "val": 980,
                "items": {
                    "吴兴区": 981,
                    "南浔区": 982,
                    "德清县": 983,
                    "长兴县": 984,
                    "安吉县": 985
                }
            },
            "绍兴市": {
                "val": 986,
                "items": {
                    "越城区": 987,
                    "柯桥区": 988,
                    "上虞区": 989,
                    "新昌县": 990,
                    "诸暨市": 991,
                    "嵊州市": 992
                }
            },
            "金华市": {
                "val": 993,
                "items": {
                    "婺城区": 994,
                    "金东区": 995,
                    "武义县": 996,
                    "浦江县": 997,
                    "磐安县": 998,
                    "兰溪市": 999,
                    "义乌市": 1000,
                    "东阳市": 1001,
                    "永康市": 1002
                }
            },
            "衢州市": {
                "val": 1003,
                "items": {
                    "柯城区": 1004,
                    "衢江区": 1005,
                    "常山县": 1006,
                    "开化县": 1007,
                    "龙游县": 1008,
                    "江山市": 1009
                }
            },
            "舟山市": {
                "val": 1010,
                "items": {
                    "定海区": 1011,
                    "普陀区": 1012,
                    "岱山县": 1013,
                    "嵊泗县": 1014
                }
            },
            "台州市": {
                "val": 1015,
                "items": {
                    "椒江区": 1016,
                    "黄岩区": 1017,
                    "路桥区": 1018,
                    "玉环县": 1019,
                    "三门县": 1020,
                    "天台县": 1021,
                    "仙居县": 1022,
                    "温岭市": 1023,
                    "临海市": 1024
                }
            },
            "丽水市": {
                "val": 1025,
                "items": {
                    "莲都区": 1026,
                    "青田县": 1027,
                    "缙云县": 1028,
                    "遂昌县": 1029,
                    "松阳县": 1030,
                    "云和县": 1031,
                    "庆元县": 1032,
                    "景宁畲族自治县": 1033,
                    "龙泉市": 1034
                }
            },
            "舟山群岛新区": {
                "val": 1035,
                "items": {
                    "金塘岛": 1036,
                    "六横岛": 1037,
                    "衢山岛": 1038,
                    "舟山本岛西北部": 1039,
                    "岱山岛西南部": 1040,
                    "泗礁岛": 1041,
                    "朱家尖岛": 1042,
                    "洋山岛": 1043,
                    "长涂岛": 1044,
                    "虾峙岛": 1045
                }
            }
        }
    },
    "安徽省": {
        "val": 1046,
        "items": {
            "合肥市": {
                "val": 1047,
                "items": {
                    "瑶海区": 1048,
                    "庐阳区": 1049,
                    "蜀山区": 1050,
                    "包河区": 1051,
                    "长丰县": 1052,
                    "肥东县": 1053,
                    "肥西县": 1054,
                    "庐江县": 1055,
                    "巢湖市": 1056
                }
            },
            "芜湖市": {
                "val": 1057,
                "items": {
                    "镜湖区": 1058,
                    "弋江区": 1059,
                    "鸠江区": 1060,
                    "三山区": 1061,
                    "芜湖县": 1062,
                    "繁昌县": 1063,
                    "南陵县": 1064,
                    "无为县": 1065
                }
            },
            "蚌埠市": {
                "val": 1066,
                "items": {
                    "龙子湖区": 1067,
                    "蚌山区": 1068,
                    "禹会区": 1069,
                    "淮上区": 1070,
                    "怀远县": 1071,
                    "五河县": 1072,
                    "固镇县": 1073
                }
            },
            "淮南市": {
                "val": 1074,
                "items": {
                    "大通区": 1075,
                    "田家庵区": 1076,
                    "谢家集区": 1077,
                    "八公山区": 1078,
                    "潘集区": 1079,
                    "凤台县": 1080
                }
            },
            "马鞍山市": {
                "val": 1081,
                "items": {
                    "花山区": 1082,
                    "雨山区": 1083,
                    "博望区": 1084,
                    "当涂县": 1085,
                    "含山县": 1086,
                    "和县": 1087
                }
            },
            "淮北市": {
                "val": 1088,
                "items": {
                    "杜集区": 1089,
                    "相山区": 1090,
                    "烈山区": 1091,
                    "濉溪县": 1092
                }
            },
            "铜陵市": {
                "val": 1093,
                "items": {
                    "铜官山区": 1094,
                    "狮子山区": 1095,
                    "郊区": 1096,
                    "铜陵县": 1097
                }
            },
            "安庆市": {
                "val": 1098,
                "items": {
                    "迎江区": 1099,
                    "大观区": 1100,
                    "宜秀区": 1101,
                    "怀宁县": 1102,
                    "枞阳县": 1103,
                    "潜山县": 1104,
                    "太湖县": 1105,
                    "宿松县": 1106,
                    "望江县": 1107,
                    "岳西县": 1108,
                    "桐城市": 1109
                }
            },
            "黄山市": {
                "val": 1110,
                "items": {
                    "屯溪区": 1111,
                    "黄山区": 1112,
                    "徽州区": 1113,
                    "歙县": 1114,
                    "休宁县": 1115,
                    "黟县": 1116,
                    "祁门县": 1117
                }
            },
            "滁州市": {
                "val": 1118,
                "items": {
                    "琅琊区": 1119,
                    "南谯区": 1120,
                    "来安县": 1121,
                    "全椒县": 1122,
                    "定远县": 1123,
                    "凤阳县": 1124,
                    "天长市": 1125,
                    "明光市": 1126
                }
            },
            "阜阳市": {
                "val": 1127,
                "items": {
                    "颍州区": 1128,
                    "颍东区": 1129,
                    "颍泉区": 1130,
                    "临泉县": 1131,
                    "太和县": 1132,
                    "阜南县": 1133,
                    "颍上县": 1134,
                    "界首市": 1135
                }
            },
            "宿州市": {
                "val": 1136,
                "items": {
                    "埇桥区": 1137,
                    "砀山县": 1138,
                    "萧县": 1139,
                    "灵璧县": 1140,
                    "泗县": 1141
                }
            },
            "六安市": {
                "val": 1142,
                "items": {
                    "金安区": 1143,
                    "裕安区": 1144,
                    "寿县": 1145,
                    "霍邱县": 1146,
                    "舒城县": 1147,
                    "金寨县": 1148,
                    "霍山县": 1149
                }
            },
            "亳州市": {
                "val": 1150,
                "items": {
                    "谯城区": 1151,
                    "涡阳县": 1152,
                    "蒙城县": 1153,
                    "利辛县": 1154
                }
            },
            "池州市": {
                "val": 1155,
                "items": {
                    "贵池区": 1156,
                    "东至县": 1157,
                    "石台县": 1158,
                    "青阳县": 1159
                }
            },
            "宣城市": {
                "val": 1160,
                "items": {
                    "宣州区": 1161,
                    "郎溪县": 1162,
                    "广德县": 1163,
                    "泾县": 1164,
                    "绩溪县": 1165,
                    "旌德县": 1166,
                    "宁国市": 1167
                }
            }
        }
    },
    "福建省": {
        "val": 1168,
        "items": {
            "福州市": {
                "val": 1169,
                "items": {
                    "鼓楼区": 1170,
                    "台江区": 1171,
                    "仓山区": 1172,
                    "马尾区": 1173,
                    "晋安区": 1174,
                    "闽侯县": 1175,
                    "连江县": 1176,
                    "罗源县": 1177,
                    "闽清县": 1178,
                    "永泰县": 1179,
                    "平潭县": 1180,
                    "福清市": 1181,
                    "长乐市": 1182
                }
            },
            "厦门市": {
                "val": 1183,
                "items": {
                    "思明区": 1184,
                    "海沧区": 1185,
                    "湖里区": 1186,
                    "集美区": 1187,
                    "同安区": 1188,
                    "翔安区": 1189
                }
            },
            "莆田市": {
                "val": 1190,
                "items": {
                    "城厢区": 1191,
                    "涵江区": 1192,
                    "荔城区": 1193,
                    "秀屿区": 1194,
                    "仙游县": 1195
                }
            },
            "三明市": {
                "val": 1196,
                "items": {
                    "梅列区": 1197,
                    "三元区": 1198,
                    "明溪县": 1199,
                    "清流县": 1200,
                    "宁化县": 1201,
                    "大田县": 1202,
                    "尤溪县": 1203,
                    "沙县": 1204,
                    "将乐县": 1205,
                    "泰宁县": 1206,
                    "建宁县": 1207,
                    "永安市": 1208
                }
            },
            "泉州市": {
                "val": 1209,
                "items": {
                    "鲤城区": 1210,
                    "丰泽区": 1211,
                    "洛江区": 1212,
                    "泉港区": 1213,
                    "惠安县": 1214,
                    "安溪县": 1215,
                    "永春县": 1216,
                    "德化县": 1217,
                    "金门县": 1218,
                    "石狮市": 1219,
                    "晋江市": 1220,
                    "南安市": 1221
                }
            },
            "漳州市": {
                "val": 1222,
                "items": {
                    "芗城区": 1223,
                    "龙文区": 1224,
                    "云霄县": 1225,
                    "漳浦县": 1226,
                    "诏安县": 1227,
                    "长泰县": 1228,
                    "东山县": 1229,
                    "南靖县": 1230,
                    "平和县": 1231,
                    "华安县": 1232,
                    "龙海市": 1233
                }
            },
            "南平市": {
                "val": 1234,
                "items": {
                    "延平区": 1235,
                    "建阳区": 1236,
                    "顺昌县": 1237,
                    "浦城县": 1238,
                    "光泽县": 1239,
                    "松溪县": 1240,
                    "政和县": 1241,
                    "邵武市": 1242,
                    "武夷山市": 1243,
                    "建瓯市": 1244
                }
            },
            "龙岩市": {
                "val": 1245,
                "items": {
                    "新罗区": 1246,
                    "长汀县": 1247,
                    "永定区": 1248,
                    "上杭县": 1249,
                    "武平县": 1250,
                    "连城县": 1251,
                    "漳平市": 1252
                }
            },
            "宁德市": {
                "val": 1253,
                "items": {
                    "蕉城区": 1254,
                    "霞浦县": 1255,
                    "古田县": 1256,
                    "屏南县": 1257,
                    "寿宁县": 1258,
                    "周宁县": 1259,
                    "柘荣县": 1260,
                    "福安市": 1261,
                    "福鼎市": 1262
                }
            }
        }
    },
    "江西省": {
        "val": 1263,
        "items": {
            "南昌市": {
                "val": 1264,
                "items": {
                    "东湖区": 1265,
                    "西湖区": 1266,
                    "青云谱区": 1267,
                    "湾里区": 1268,
                    "青山湖区": 1269,
                    "南昌县": 1270,
                    "新建县": 1271,
                    "安义县": 1272,
                    "进贤县": 1273
                }
            },
            "景德镇市": {
                "val": 1274,
                "items": {
                    "昌江区": 1275,
                    "珠山区": 1276,
                    "浮梁县": 1277,
                    "乐平市": 1278
                }
            },
            "萍乡市": {
                "val": 1279,
                "items": {
                    "安源区": 1280,
                    "湘东区": 1281,
                    "莲花县": 1282,
                    "上栗县": 1283,
                    "芦溪县": 1284
                }
            },
            "九江市": {
                "val": 1285,
                "items": {
                    "庐山区": 1286,
                    "浔阳区": 1287,
                    "九江县": 1288,
                    "武宁县": 1289,
                    "修水县": 1290,
                    "永修县": 1291,
                    "德安县": 1292,
                    "星子县": 1293,
                    "都昌县": 1294,
                    "湖口县": 1295,
                    "彭泽县": 1296,
                    "瑞昌市": 1297,
                    "共青城市": 1298
                }
            },
            "新余市": {
                "val": 1299,
                "items": {
                    "渝水区": 1300,
                    "分宜县": 1301
                }
            },
            "鹰潭市": {
                "val": 1302,
                "items": {
                    "月湖区": 1303,
                    "余江县": 1304,
                    "贵溪市": 1305
                }
            },
            "赣州市": {
                "val": 1306,
                "items": {
                    "章贡区": 1307,
                    "南康区": 1308,
                    "赣县": 1309,
                    "信丰县": 1310,
                    "大余县": 1311,
                    "上犹县": 1312,
                    "崇义县": 1313,
                    "安远县": 1314,
                    "龙南县": 1315,
                    "定南县": 1316,
                    "全南县": 1317,
                    "宁都县": 1318,
                    "于都县": 1319,
                    "兴国县": 1320,
                    "会昌县": 1321,
                    "寻乌县": 1322,
                    "石城县": 1323,
                    "瑞金市": 1324
                }
            },
            "吉安市": {
                "val": 1325,
                "items": {
                    "吉州区": 1326,
                    "青原区": 1327,
                    "吉安县": 1328,
                    "吉水县": 1329,
                    "峡江县": 1330,
                    "新干县": 1331,
                    "永丰县": 1332,
                    "泰和县": 1333,
                    "遂川县": 1334,
                    "万安县": 1335,
                    "安福县": 1336,
                    "永新县": 1337,
                    "井冈山市": 1338
                }
            },
            "宜春市": {
                "val": 1339,
                "items": {
                    "袁州区": 1340,
                    "奉新县": 1341,
                    "万载县": 1342,
                    "上高县": 1343,
                    "宜丰县": 1344,
                    "靖安县": 1345,
                    "铜鼓县": 1346,
                    "丰城市": 1347,
                    "樟树市": 1348,
                    "高安市": 1349
                }
            },
            "抚州市": {
                "val": 1350,
                "items": {
                    "临川区": 1351,
                    "南城县": 1352,
                    "黎川县": 1353,
                    "南丰县": 1354,
                    "崇仁县": 1355,
                    "乐安县": 1356,
                    "宜黄县": 1357,
                    "金溪县": 1358,
                    "资溪县": 1359,
                    "东乡县": 1360,
                    "广昌县": 1361
                }
            },
            "上饶市": {
                "val": 1362,
                "items": {
                    "信州区": 1363,
                    "上饶县": 1364,
                    "广丰县": 1365,
                    "玉山县": 1366,
                    "铅山县": 1367,
                    "横峰县": 1368,
                    "弋阳县": 1369,
                    "余干县": 1370,
                    "鄱阳县": 1371,
                    "万年县": 1372,
                    "婺源县": 1373,
                    "德兴市": 1374
                }
            }
        }
    },
    "山东省": {
        "val": 1375,
        "items": {
            "济南市": {
                "val": 1376,
                "items": {
                    "历下区": 1377,
                    "市中区": 1378,
                    "槐荫区": 1379,
                    "天桥区": 1380,
                    "历城区": 1381,
                    "长清区": 1382,
                    "平阴县": 1383,
                    "济阳县": 1384,
                    "商河县": 1385,
                    "章丘市": 1386
                }
            },
            "青岛市": {
                "val": 1387,
                "items": {
                    "市南区": 1388,
                    "市北区": 1389,
                    "黄岛区": 1390,
                    "崂山区": 1391,
                    "李沧区": 1392,
                    "城阳区": 1393,
                    "胶州市": 1394,
                    "即墨市": 1395,
                    "平度市": 1396,
                    "莱西市": 1397,
                    "西海岸新区": 1398
                }
            },
            "淄博市": {
                "val": 1399,
                "items": {
                    "淄川区": 1400,
                    "张店区": 1401,
                    "博山区": 1402,
                    "临淄区": 1403,
                    "周村区": 1404,
                    "桓台县": 1405,
                    "高青县": 1406,
                    "沂源县": 1407
                }
            },
            "枣庄市": {
                "val": 1408,
                "items": {
                    "市中区": 1409,
                    "薛城区": 1410,
                    "峄城区": 1411,
                    "台儿庄区": 1412,
                    "山亭区": 1413,
                    "滕州市": 1414
                }
            },
            "东营市": {
                "val": 1415,
                "items": {
                    "东营区": 1416,
                    "河口区": 1417,
                    "垦利县": 1418,
                    "利津县": 1419,
                    "广饶县": 1420
                }
            },
            "烟台市": {
                "val": 1421,
                "items": {
                    "芝罘区": 1422,
                    "福山区": 1423,
                    "牟平区": 1424,
                    "莱山区": 1425,
                    "长岛县": 1426,
                    "龙口市": 1427,
                    "莱阳市": 1428,
                    "莱州市": 1429,
                    "蓬莱市": 1430,
                    "招远市": 1431,
                    "栖霞市": 1432,
                    "海阳市": 1433
                }
            },
            "潍坊市": {
                "val": 1434,
                "items": {
                    "潍城区": 1435,
                    "寒亭区": 1436,
                    "坊子区": 1437,
                    "奎文区": 1438,
                    "临朐县": 1439,
                    "昌乐县": 1440,
                    "青州市": 1441,
                    "诸城市": 1442,
                    "寿光市": 1443,
                    "安丘市": 1444,
                    "高密市": 1445,
                    "昌邑市": 1446
                }
            },
            "济宁市": {
                "val": 1447,
                "items": {
                    "任城区": 1448,
                    "兖州区": 1449,
                    "微山县": 1450,
                    "鱼台县": 1451,
                    "金乡县": 1452,
                    "嘉祥县": 1453,
                    "汶上县": 1454,
                    "泗水县": 1455,
                    "梁山县": 1456,
                    "曲阜市": 1457,
                    "邹城市": 1458
                }
            },
            "泰安市": {
                "val": 1459,
                "items": {
                    "泰山区": 1460,
                    "岱岳区": 1461,
                    "宁阳县": 1462,
                    "东平县": 1463,
                    "新泰市": 1464,
                    "肥城市": 1465
                }
            },
            "威海市": {
                "val": 1466,
                "items": {
                    "环翠区": 1467,
                    "文登区": 1468,
                    "荣成市": 1469,
                    "乳山市": 1470
                }
            },
            "日照市": {
                "val": 1471,
                "items": {
                    "东港区": 1472,
                    "岚山区": 1473,
                    "五莲县": 1474,
                    "莒县": 1475
                }
            },
            "莱芜市": {
                "val": 1476,
                "items": {
                    "莱城区": 1477,
                    "钢城区": 1478
                }
            },
            "临沂市": {
                "val": 1479,
                "items": {
                    "兰山区": 1480,
                    "罗庄区": 1481,
                    "河东区": 1482,
                    "沂南县": 1483,
                    "郯城县": 1484,
                    "沂水县": 1485,
                    "兰陵县": 1486,
                    "费县": 1487,
                    "平邑县": 1488,
                    "莒南县": 1489,
                    "蒙阴县": 1490,
                    "临沭县": 1491
                }
            },
            "德州市": {
                "val": 1492,
                "items": {
                    "德城区": 1493,
                    "陵城区": 1494,
                    "宁津县": 1495,
                    "庆云县": 1496,
                    "临邑县": 1497,
                    "齐河县": 1498,
                    "平原县": 1499,
                    "夏津县": 1500,
                    "武城县": 1501,
                    "乐陵市": 1502,
                    "禹城市": 1503
                }
            },
            "聊城市": {
                "val": 1504,
                "items": {
                    "东昌府区": 1505,
                    "阳谷县": 1506,
                    "莘县": 1507,
                    "茌平县": 1508,
                    "东阿县": 1509,
                    "冠县": 1510,
                    "高唐县": 1511,
                    "临清市": 1512
                }
            },
            "滨州市": {
                "val": 1513,
                "items": {
                    "滨城区": 1514,
                    "沾化区": 1515,
                    "惠民县": 1516,
                    "阳信县": 1517,
                    "无棣县": 1518,
                    "博兴县": 1519,
                    "邹平县": 1520,
                    "北海新区": 1521
                }
            },
            "菏泽市": {
                "val": 1522,
                "items": {
                    "牡丹区": 1523,
                    "曹县": 1524,
                    "单县": 1525,
                    "成武县": 1526,
                    "巨野县": 1527,
                    "郓城县": 1528,
                    "鄄城县": 1529,
                    "定陶县": 1530,
                    "东明县": 1531
                }
            }
        }
    },
    "河南省": {
        "val": 1532,
        "items": {
            "郑州市": {
                "val": 1533,
                "items": {
                    "中原区": 1534,
                    "二七区": 1535,
                    "管城回族区": 1536,
                    "金水区": 1537,
                    "上街区": 1538,
                    "惠济区": 1539,
                    "中牟县": 1540,
                    "巩义市": 1541,
                    "荥阳市": 1542,
                    "新密市": 1543,
                    "新郑市": 1544,
                    "登封市": 1545
                }
            },
            "开封市": {
                "val": 1546,
                "items": {
                    "龙亭区": 1547,
                    "顺河回族区": 1548,
                    "鼓楼区": 1549,
                    "禹王台区": 1550,
                    "祥符区": 1551,
                    "杞县": 1552,
                    "通许县": 1553,
                    "尉氏县": 1554,
                    "兰考县": 1555
                }
            },
            "洛阳市": {
                "val": 1556,
                "items": {
                    "老城区": 1557,
                    "西工区": 1558,
                    "瀍河回族区": 1559,
                    "涧西区": 1560,
                    "吉利区": 1561,
                    "洛龙区": 1562,
                    "孟津县": 1563,
                    "新安县": 1564,
                    "栾川县": 1565,
                    "嵩县": 1566,
                    "汝阳县": 1567,
                    "宜阳县": 1568,
                    "洛宁县": 1569,
                    "伊川县": 1570,
                    "偃师市": 1571
                }
            },
            "平顶山市": {
                "val": 1572,
                "items": {
                    "新华区": 1573,
                    "卫东区": 1574,
                    "石龙区": 1575,
                    "湛河区": 1576,
                    "宝丰县": 1577,
                    "叶县": 1578,
                    "鲁山县": 1579,
                    "郏县": 1580,
                    "舞钢市": 1581,
                    "汝州市": 1582
                }
            },
            "安阳市": {
                "val": 1583,
                "items": {
                    "文峰区": 1584,
                    "北关区": 1585,
                    "殷都区": 1586,
                    "龙安区": 1587,
                    "安阳县": 1588,
                    "汤阴县": 1589,
                    "滑县": 1590,
                    "内黄县": 1591,
                    "林州市": 1592
                }
            },
            "鹤壁市": {
                "val": 1593,
                "items": {
                    "鹤山区": 1594,
                    "山城区": 1595,
                    "淇滨区": 1596,
                    "浚县": 1597,
                    "淇县": 1598
                }
            },
            "新乡市": {
                "val": 1599,
                "items": {
                    "红旗区": 1600,
                    "卫滨区": 1601,
                    "凤泉区": 1602,
                    "牧野区": 1603,
                    "新乡县": 1604,
                    "获嘉县": 1605,
                    "原阳县": 1606,
                    "延津县": 1607,
                    "封丘县": 1608,
                    "长垣县": 1609,
                    "卫辉市": 1610,
                    "辉县市": 1611
                }
            },
            "焦作市": {
                "val": 1612,
                "items": {
                    "解放区": 1613,
                    "中站区": 1614,
                    "马村区": 1615,
                    "山阳区": 1616,
                    "修武县": 1617,
                    "博爱县": 1618,
                    "武陟县": 1619,
                    "温县": 1620,
                    "沁阳市": 1621,
                    "孟州市": 1622
                }
            },
            "濮阳市": {
                "val": 1623,
                "items": {
                    "华龙区": 1624,
                    "清丰县": 1625,
                    "南乐县": 1626,
                    "范县": 1627,
                    "台前县": 1628,
                    "濮阳县": 1629
                }
            },
            "许昌市": {
                "val": 1630,
                "items": {
                    "魏都区": 1631,
                    "许昌县": 1632,
                    "鄢陵县": 1633,
                    "襄城县": 1634,
                    "禹州市": 1635,
                    "长葛市": 1636
                }
            },
            "漯河市": {
                "val": 1637,
                "items": {
                    "源汇区": 1638,
                    "郾城区": 1639,
                    "召陵区": 1640,
                    "舞阳县": 1641,
                    "临颍县": 1642
                }
            },
            "三门峡市": {
                "val": 1643,
                "items": {
                    "湖滨区": 1644,
                    "渑池县": 1645,
                    "陕县": 1646,
                    "卢氏县": 1647,
                    "义马市": 1648,
                    "灵宝市": 1649
                }
            },
            "南阳市": {
                "val": 1650,
                "items": {
                    "宛城区": 1651,
                    "卧龙区": 1652,
                    "南召县": 1653,
                    "方城县": 1654,
                    "西峡县": 1655,
                    "镇平县": 1656,
                    "内乡县": 1657,
                    "淅川县": 1658,
                    "社旗县": 1659,
                    "唐河县": 1660,
                    "新野县": 1661,
                    "桐柏县": 1662,
                    "邓州市": 1663
                }
            },
            "商丘市": {
                "val": 1664,
                "items": {
                    "梁园区": 1665,
                    "睢阳区": 1666,
                    "民权县": 1667,
                    "睢县": 1668,
                    "宁陵县": 1669,
                    "柘城县": 1670,
                    "虞城县": 1671,
                    "夏邑县": 1672,
                    "永城市": 1673
                }
            },
            "信阳市": {
                "val": 1674,
                "items": {
                    "浉河区": 1675,
                    "平桥区": 1676,
                    "罗山县": 1677,
                    "光山县": 1678,
                    "新县": 1679,
                    "商城县": 1680,
                    "固始县": 1681,
                    "潢川县": 1682,
                    "淮滨县": 1683,
                    "息县": 1684
                }
            },
            "周口市": {
                "val": 1685,
                "items": {
                    "川汇区": 1686,
                    "扶沟县": 1687,
                    "西华县": 1688,
                    "商水县": 1689,
                    "沈丘县": 1690,
                    "郸城县": 1691,
                    "淮阳县": 1692,
                    "太康县": 1693,
                    "鹿邑县": 1694,
                    "项城市": 1695
                }
            },
            "驻马店市": {
                "val": 1696,
                "items": {
                    "驿城区": 1697,
                    "西平县": 1698,
                    "上蔡县": 1699,
                    "平舆县": 1700,
                    "正阳县": 1701,
                    "确山县": 1702,
                    "泌阳县": 1703,
                    "汝南县": 1704,
                    "遂平县": 1705,
                    "新蔡县": 1706
                }
            },
            "直辖县级": {
                "val": 1707,
                "items": {
                    "济源市": 1708
                }
            }
        }
    },
    "湖北省": {
        "val": 1709,
        "items": {
            "武汉市": {
                "val": 1710,
                "items": {
                    "江岸区": 1711,
                    "江汉区": 1712,
                    "硚口区": 1713,
                    "汉阳区": 1714,
                    "武昌区": 1715,
                    "青山区": 1716,
                    "洪山区": 1717,
                    "东西湖区": 1718,
                    "汉南区": 1719,
                    "蔡甸区": 1720,
                    "江夏区": 1721,
                    "黄陂区": 1722,
                    "新洲区": 1723
                }
            },
            "黄石市": {
                "val": 1724,
                "items": {
                    "黄石港区": 1725,
                    "西塞山区": 1726,
                    "下陆区": 1727,
                    "铁山区": 1728,
                    "阳新县": 1729,
                    "大冶市": 1730
                }
            },
            "十堰市": {
                "val": 1731,
                "items": {
                    "茅箭区": 1732,
                    "张湾区": 1733,
                    "郧阳区": 1734,
                    "郧西县": 1735,
                    "竹山县": 1736,
                    "竹溪县": 1737,
                    "房县": 1738,
                    "丹江口市": 1739
                }
            },
            "宜昌市": {
                "val": 1740,
                "items": {
                    "西陵区": 1741,
                    "伍家岗区": 1742,
                    "点军区": 1743,
                    "猇亭区": 1744,
                    "夷陵区": 1745,
                    "远安县": 1746,
                    "兴山县": 1747,
                    "秭归县": 1748,
                    "长阳土家族自治县": 1749,
                    "五峰土家族自治县": 1750,
                    "宜都市": 1751,
                    "当阳市": 1752,
                    "枝江市": 1753
                }
            },
            "襄阳市": {
                "val": 1754,
                "items": {
                    "襄城区": 1755,
                    "樊城区": 1756,
                    "襄州区": 1757,
                    "南漳县": 1758,
                    "谷城县": 1759,
                    "保康县": 1760,
                    "老河口市": 1761,
                    "枣阳市": 1762,
                    "宜城市": 1763
                }
            },
            "鄂州市": {
                "val": 1764,
                "items": {
                    "梁子湖区": 1765,
                    "华容区": 1766,
                    "鄂城区": 1767
                }
            },
            "荆门市": {
                "val": 1768,
                "items": {
                    "东宝区": 1769,
                    "掇刀区": 1770,
                    "京山县": 1771,
                    "沙洋县": 1772,
                    "钟祥市": 1773
                }
            },
            "孝感市": {
                "val": 1774,
                "items": {
                    "孝南区": 1775,
                    "孝昌县": 1776,
                    "大悟县": 1777,
                    "云梦县": 1778,
                    "应城市": 1779,
                    "安陆市": 1780,
                    "汉川市": 1781
                }
            },
            "荆州市": {
                "val": 1782,
                "items": {
                    "沙市区": 1783,
                    "荆州区": 1784,
                    "公安县": 1785,
                    "监利县": 1786,
                    "江陵县": 1787,
                    "石首市": 1788,
                    "洪湖市": 1789,
                    "松滋市": 1790
                }
            },
            "黄冈市": {
                "val": 1791,
                "items": {
                    "黄州区": 1792,
                    "团风县": 1793,
                    "红安县": 1794,
                    "罗田县": 1795,
                    "英山县": 1796,
                    "浠水县": 1797,
                    "蕲春县": 1798,
                    "黄梅县": 1799,
                    "麻城市": 1800,
                    "武穴市": 1801
                }
            },
            "咸宁市": {
                "val": 1802,
                "items": {
                    "咸安区": 1803,
                    "嘉鱼县": 1804,
                    "通城县": 1805,
                    "崇阳县": 1806,
                    "通山县": 1807,
                    "赤壁市": 1808
                }
            },
            "随州市": {
                "val": 1809,
                "items": {
                    "曾都区": 1810,
                    "随县": 1811,
                    "广水市": 1812
                }
            },
            "恩施土家族苗族自治州": {
                "val": 1813,
                "items": {
                    "恩施市": 1814,
                    "利川市": 1815,
                    "建始县": 1816,
                    "巴东县": 1817,
                    "宣恩县": 1818,
                    "咸丰县": 1819,
                    "来凤县": 1820,
                    "鹤峰县": 1821
                }
            },
            "直辖县级": {
                "val": 1822,
                "items": {
                    "仙桃市": 1823,
                    "潜江市": 1824,
                    "天门市": 1825,
                    "神农架林区": 1826
                }
            }
        }
    },
    "湖南省": {
        "val": 1827,
        "items": {
            "长沙市": {
                "val": 1828,
                "items": {
                    "芙蓉区": 1829,
                    "天心区": 1830,
                    "岳麓区": 1831,
                    "开福区": 1832,
                    "雨花区": 1833,
                    "望城区": 1834,
                    "长沙县": 1835,
                    "宁乡县": 1836,
                    "浏阳市": 1837
                }
            },
            "株洲市": {
                "val": 1838,
                "items": {
                    "荷塘区": 1839,
                    "芦淞区": 1840,
                    "石峰区": 1841,
                    "天元区": 1842,
                    "株洲县": 1843,
                    "攸县": 1844,
                    "茶陵县": 1845,
                    "炎陵县": 1846,
                    "醴陵市": 1847
                }
            },
            "湘潭市": {
                "val": 1848,
                "items": {
                    "雨湖区": 1849,
                    "岳塘区": 1850,
                    "湘潭县": 1851,
                    "湘乡市": 1852,
                    "韶山市": 1853
                }
            },
            "衡阳市": {
                "val": 1854,
                "items": {
                    "珠晖区": 1855,
                    "雁峰区": 1856,
                    "石鼓区": 1857,
                    "蒸湘区": 1858,
                    "南岳区": 1859,
                    "衡阳县": 1860,
                    "衡南县": 1861,
                    "衡山县": 1862,
                    "衡东县": 1863,
                    "祁东县": 1864,
                    "耒阳市": 1865,
                    "常宁市": 1866
                }
            },
            "邵阳市": {
                "val": 1867,
                "items": {
                    "双清区": 1868,
                    "大祥区": 1869,
                    "北塔区": 1870,
                    "邵东县": 1871,
                    "新邵县": 1872,
                    "邵阳县": 1873,
                    "隆回县": 1874,
                    "洞口县": 1875,
                    "绥宁县": 1876,
                    "新宁县": 1877,
                    "城步苗族自治县": 1878,
                    "武冈市": 1879
                }
            },
            "岳阳市": {
                "val": 1880,
                "items": {
                    "岳阳楼区": 1881,
                    "云溪区": 1882,
                    "君山区": 1883,
                    "岳阳县": 1884,
                    "华容县": 1885,
                    "湘阴县": 1886,
                    "平江县": 1887,
                    "汨罗市": 1888,
                    "临湘市": 1889
                }
            },
            "常德市": {
                "val": 1890,
                "items": {
                    "武陵区": 1891,
                    "鼎城区": 1892,
                    "安乡县": 1893,
                    "汉寿县": 1894,
                    "澧县": 1895,
                    "临澧县": 1896,
                    "桃源县": 1897,
                    "石门县": 1898,
                    "津市市": 1899
                }
            },
            "张家界市": {
                "val": 1900,
                "items": {
                    "永定区": 1901,
                    "武陵源区": 1902,
                    "慈利县": 1903,
                    "桑植县": 1904
                }
            },
            "益阳市": {
                "val": 1905,
                "items": {
                    "资阳区": 1906,
                    "赫山区": 1907,
                    "南县": 1908,
                    "桃江县": 1909,
                    "安化县": 1910,
                    "沅江市": 1911
                }
            },
            "郴州市": {
                "val": 1912,
                "items": {
                    "北湖区": 1913,
                    "苏仙区": 1914,
                    "桂阳县": 1915,
                    "宜章县": 1916,
                    "永兴县": 1917,
                    "嘉禾县": 1918,
                    "临武县": 1919,
                    "汝城县": 1920,
                    "桂东县": 1921,
                    "安仁县": 1922,
                    "资兴市": 1923
                }
            },
            "永州市": {
                "val": 1924,
                "items": {
                    "零陵区": 1925,
                    "冷水滩区": 1926,
                    "祁阳县": 1927,
                    "东安县": 1928,
                    "双牌县": 1929,
                    "道县": 1930,
                    "江永县": 1931,
                    "宁远县": 1932,
                    "蓝山县": 1933,
                    "新田县": 1934,
                    "江华瑶族自治县": 1935
                }
            },
            "怀化市": {
                "val": 1936,
                "items": {
                    "鹤城区": 1937,
                    "中方县": 1938,
                    "沅陵县": 1939,
                    "辰溪县": 1940,
                    "溆浦县": 1941,
                    "会同县": 1942,
                    "麻阳苗族自治县": 1943,
                    "新晃侗族自治县": 1944,
                    "芷江侗族自治县": 1945,
                    "靖州苗族侗族自治县": 1946,
                    "通道侗族自治县": 1947,
                    "洪江市": 1948
                }
            },
            "娄底市": {
                "val": 1949,
                "items": {
                    "娄星区": 1950,
                    "双峰县": 1951,
                    "新化县": 1952,
                    "冷水江市": 1953,
                    "涟源市": 1954
                }
            },
            "湘西土家族苗族自治州": {
                "val": 1955,
                "items": {
                    "吉首市": 1956,
                    "泸溪县": 1957,
                    "凤凰县": 1958,
                    "花垣县": 1959,
                    "保靖县": 1960,
                    "古丈县": 1961,
                    "永顺县": 1962,
                    "龙山县": 1963
                }
            }
        }
    },
    "广东省": {
        "val": 1964,
        "items": {
            "广州市": {
                "val": 1965,
                "items": {
                    "荔湾区": 1966,
                    "越秀区": 1967,
                    "海珠区": 1968,
                    "天河区": 1969,
                    "白云区": 1970,
                    "黄埔区": 1971,
                    "番禺区": 1972,
                    "花都区": 1973,
                    "南沙区": 1974,
                    "从化区": 1975,
                    "增城区": 1976
                }
            },
            "韶关市": {
                "val": 1977,
                "items": {
                    "武江区": 1978,
                    "浈江区": 1979,
                    "曲江区": 1980,
                    "始兴县": 1981,
                    "仁化县": 1982,
                    "翁源县": 1983,
                    "乳源瑶族自治县": 1984,
                    "新丰县": 1985,
                    "乐昌市": 1986,
                    "南雄市": 1987
                }
            },
            "深圳市": {
                "val": 1988,
                "items": {
                    "罗湖区": 1989,
                    "福田区": 1990,
                    "南山区": 1991,
                    "宝安区": 1992,
                    "龙岗区": 1993,
                    "盐田区": 1994,
                    "光明新区": 1995,
                    "坪山新区": 1996,
                    "大鹏新区": 1997,
                    "龙华新区": 1998
                }
            },
            "珠海市": {
                "val": 1999,
                "items": {
                    "香洲区": 2000,
                    "斗门区": 2001,
                    "金湾区": 2002
                }
            },
            "汕头市": {
                "val": 2003,
                "items": {
                    "龙湖区": 2004,
                    "金平区": 2005,
                    "濠江区": 2006,
                    "潮阳区": 2007,
                    "潮南区": 2008,
                    "澄海区": 2009,
                    "南澳县": 2010
                }
            },
            "佛山市": {
                "val": 2011,
                "items": {
                    "禅城区": 2012,
                    "南海区": 2013,
                    "顺德区": 2014,
                    "三水区": 2015,
                    "高明区": 2016
                }
            },
            "江门市": {
                "val": 2017,
                "items": {
                    "蓬江区": 2018,
                    "江海区": 2019,
                    "新会区": 2020,
                    "台山市": 2021,
                    "开平市": 2022,
                    "鹤山市": 2023,
                    "恩平市": 2024
                }
            },
            "湛江市": {
                "val": 2025,
                "items": {
                    "赤坎区": 2026,
                    "霞山区": 2027,
                    "坡头区": 2028,
                    "麻章区": 2029,
                    "遂溪县": 2030,
                    "徐闻县": 2031,
                    "廉江市": 2032,
                    "雷州市": 2033,
                    "吴川市": 2034
                }
            },
            "茂名市": {
                "val": 2035,
                "items": {
                    "茂南区": 2036,
                    "电白区": 2037,
                    "高州市": 2038,
                    "化州市": 2039,
                    "信宜市": 2040
                }
            },
            "肇庆市": {
                "val": 2041,
                "items": {
                    "端州区": 2042,
                    "鼎湖区": 2043,
                    "广宁县": 2044,
                    "怀集县": 2045,
                    "封开县": 2046,
                    "德庆县": 2047,
                    "高要市": 2048,
                    "四会市": 2049
                }
            },
            "惠州市": {
                "val": 2050,
                "items": {
                    "惠城区": 2051,
                    "惠阳区": 2052,
                    "博罗县": 2053,
                    "惠东县": 2054,
                    "龙门县": 2055
                }
            },
            "梅州市": {
                "val": 2056,
                "items": {
                    "梅江区": 2057,
                    "梅县区": 2058,
                    "大埔县": 2059,
                    "丰顺县": 2060,
                    "五华县": 2061,
                    "平远县": 2062,
                    "蕉岭县": 2063,
                    "兴宁市": 2064
                }
            },
            "汕尾市": {
                "val": 2065,
                "items": {
                    "城区": 2066,
                    "海丰县": 2067,
                    "陆河县": 2068,
                    "陆丰市": 2069
                }
            },
            "河源市": {
                "val": 2070,
                "items": {
                    "源城区": 2071,
                    "紫金县": 2072,
                    "龙川县": 2073,
                    "连平县": 2074,
                    "和平县": 2075,
                    "东源县": 2076
                }
            },
            "阳江市": {
                "val": 2077,
                "items": {
                    "江城区": 2078,
                    "阳东区": 2079,
                    "阳西县": 2080,
                    "阳春市": 2081
                }
            },
            "清远市": {
                "val": 2082,
                "items": {
                    "清城区": 2083,
                    "清新区": 2084,
                    "佛冈县": 2085,
                    "阳山县": 2086,
                    "连山壮族瑶族自治县": 2087,
                    "连南瑶族自治县": 2088,
                    "英德市": 2089,
                    "连州市": 2090
                }
            },
            "东莞市": {
                "val": 2091,
                "items": {
                    "莞城区": 2092,
                    "南城区": 2093,
                    "万江区": 2094,
                    "石碣镇": 2095,
                    "石龙镇": 2096,
                    "茶山镇": 2097,
                    "石排镇": 2098,
                    "企石镇": 2099,
                    "横沥镇": 2100,
                    "桥头镇": 2101,
                    "谢岗镇": 2102,
                    "东坑镇": 2103,
                    "常平镇": 2104,
                    "寮步镇": 2105,
                    "大朗镇": 2106,
                    "麻涌镇": 2107,
                    "中堂镇": 2108,
                    "高埗镇": 2109,
                    "樟木头镇": 2110,
                    "大岭山镇": 2111,
                    "望牛墩镇": 2112,
                    "黄江镇": 2113,
                    "洪梅镇": 2114,
                    "清溪镇": 2115,
                    "沙田镇": 2116,
                    "道滘镇": 2117,
                    "塘厦镇": 2118,
                    "虎门镇": 2119,
                    "厚街镇": 2120,
                    "凤岗镇": 2121,
                    "长安镇": 2122
                }
            },
            "中山市": {
                "val": 2123,
                "items": {
                    "石岐区": 2124,
                    "南区": 2125,
                    "五桂山区": 2126,
                    "火炬开发区": 2127,
                    "黄圃镇": 2128,
                    "南头镇": 2129,
                    "东凤镇": 2130,
                    "阜沙镇": 2131,
                    "小榄镇": 2132,
                    "东升镇": 2133,
                    "古镇镇": 2134,
                    "横栏镇": 2135,
                    "三角镇": 2136,
                    "民众镇": 2137,
                    "南朗镇": 2138,
                    "港口镇": 2139,
                    "大涌镇": 2140,
                    "沙溪镇": 2141,
                    "三乡镇": 2142,
                    "板芙镇": 2143,
                    "神湾镇": 2144,
                    "坦洲镇": 2145
                }
            },
            "潮州市": {
                "val": 2146,
                "items": {
                    "湘桥区": 2147,
                    "潮安区": 2148,
                    "饶平县": 2149
                }
            },
            "揭阳市": {
                "val": 2150,
                "items": {
                    "榕城区": 2151,
                    "揭东区": 2152,
                    "揭西县": 2153,
                    "惠来县": 2154,
                    "普宁市": 2155
                }
            },
            "云浮市": {
                "val": 2156,
                "items": {
                    "云城区": 2157,
                    "云安区": 2158,
                    "新兴县": 2159,
                    "郁南县": 2160,
                    "罗定市": 2161
                }
            }
        }
    },
    "广西壮族自治区": {
        "val": 2162,
        "items": {
            "南宁市": {
                "val": 2163,
                "items": {
                    "兴宁区": 2164,
                    "青秀区": 2165,
                    "江南区": 2166,
                    "西乡塘区": 2167,
                    "良庆区": 2168,
                    "邕宁区": 2169,
                    "武鸣县": 2170,
                    "隆安县": 2171,
                    "马山县": 2172,
                    "上林县": 2173,
                    "宾阳县": 2174,
                    "横县": 2175,
                    "埌东新区": 2176
                }
            },
            "柳州市": {
                "val": 2177,
                "items": {
                    "城中区": 2178,
                    "鱼峰区": 2179,
                    "柳南区": 2180,
                    "柳北区": 2181,
                    "柳江县": 2182,
                    "柳城县": 2183,
                    "鹿寨县": 2184,
                    "融安县": 2185,
                    "融水苗族自治县": 2186,
                    "三江侗族自治县": 2187,
                    "柳东新区": 2188
                }
            },
            "桂林市": {
                "val": 2189,
                "items": {
                    "秀峰区": 2190,
                    "叠彩区": 2191,
                    "象山区": 2192,
                    "七星区": 2193,
                    "雁山区": 2194,
                    "临桂区": 2195,
                    "阳朔县": 2196,
                    "灵川县": 2197,
                    "全州县": 2198,
                    "兴安县": 2199,
                    "永福县": 2200,
                    "灌阳县": 2201,
                    "龙胜各族自治县": 2202,
                    "资源县": 2203,
                    "平乐县": 2204,
                    "荔浦县": 2205,
                    "恭城瑶族自治县": 2206
                }
            },
            "梧州市": {
                "val": 2207,
                "items": {
                    "万秀区": 2208,
                    "长洲区": 2209,
                    "龙圩区": 2210,
                    "苍梧县": 2211,
                    "藤县": 2212,
                    "蒙山县": 2213,
                    "岑溪市": 2214
                }
            },
            "北海市": {
                "val": 2215,
                "items": {
                    "海城区": 2216,
                    "银海区": 2217,
                    "铁山港区": 2218,
                    "合浦县": 2219
                }
            },
            "防城港市": {
                "val": 2220,
                "items": {
                    "港口区": 2221,
                    "防城区": 2222,
                    "上思县": 2223,
                    "东兴市": 2224
                }
            },
            "钦州市": {
                "val": 2225,
                "items": {
                    "钦南区": 2226,
                    "钦北区": 2227,
                    "灵山县": 2228,
                    "浦北县": 2229
                }
            },
            "贵港市": {
                "val": 2230,
                "items": {
                    "港北区": 2231,
                    "港南区": 2232,
                    "覃塘区": 2233,
                    "平南县": 2234,
                    "桂平市": 2235
                }
            },
            "玉林市": {
                "val": 2236,
                "items": {
                    "玉州区": 2237,
                    "福绵区": 2238,
                    "玉东新区": 2239,
                    "容县": 2240,
                    "陆川县": 2241,
                    "博白县": 2242,
                    "兴业县": 2243,
                    "北流市": 2244
                }
            },
            "百色市": {
                "val": 2245,
                "items": {
                    "右江区": 2246,
                    "田阳县": 2247,
                    "田东县": 2248,
                    "平果县": 2249,
                    "德保县": 2250,
                    "靖西县": 2251,
                    "那坡县": 2252,
                    "凌云县": 2253,
                    "乐业县": 2254,
                    "田林县": 2255,
                    "西林县": 2256,
                    "隆林各族自治县": 2257
                }
            },
            "贺州市": {
                "val": 2258,
                "items": {
                    "八步区": 2259,
                    "昭平县": 2260,
                    "钟山县": 2261,
                    "富川瑶族自治县": 2262,
                    "平桂管理区": 2263
                }
            },
            "河池市": {
                "val": 2264,
                "items": {
                    "金城江区": 2265,
                    "南丹县": 2266,
                    "天峨县": 2267,
                    "凤山县": 2268,
                    "东兰县": 2269,
                    "罗城仫佬族自治县": 2270,
                    "环江毛南族自治县": 2271,
                    "巴马瑶族自治县": 2272,
                    "都安瑶族自治县": 2273,
                    "大化瑶族自治县": 2274,
                    "宜州市": 2275
                }
            },
            "来宾市": {
                "val": 2276,
                "items": {
                    "兴宾区": 2277,
                    "忻城县": 2278,
                    "象州县": 2279,
                    "武宣县": 2280,
                    "金秀瑶族自治县": 2281,
                    "合山市": 2282
                }
            },
            "崇左市": {
                "val": 2283,
                "items": {
                    "江州区": 2284,
                    "扶绥县": 2285,
                    "宁明县": 2286,
                    "龙州县": 2287,
                    "大新县": 2288,
                    "天等县": 2289,
                    "凭祥市": 2290
                }
            }
        }
    },
    "海南省": {
        "val": 2291,
        "items": {
            "海口市": {
                "val": 2292,
                "items": {
                    "秀英区": 2293,
                    "龙华区": 2294,
                    "琼山区": 2295,
                    "美兰区": 2296
                }
            },
            "三亚市": {
                "val": 2297,
                "items": {
                    "海棠区": 2298,
                    "吉阳区": 2299,
                    "天涯区": 2300,
                    "崖州区": 2301
                }
            },
            "三沙市": {
                "val": 2302,
                "items": {
                    "西沙群岛": 2303,
                    "南沙群岛": 2304,
                    "中沙群岛": 2305
                }
            },
            "直辖县级": {
                "val": 2306,
                "items": {
                    "五指山市": 2307,
                    "琼海市": 2308,
                    "儋州市": 2309,
                    "文昌市": 2310,
                    "万宁市": 2311,
                    "东方市": 2312,
                    "定安县": 2313,
                    "屯昌县": 2314,
                    "澄迈县": 2315,
                    "临高县": 2316,
                    "白沙黎族自治县": 2317,
                    "昌江黎族自治县": 2318,
                    "乐东黎族自治县": 2319,
                    "陵水黎族自治县": 2320,
                    "保亭黎族苗族自治县": 2321,
                    "琼中黎族苗族自治县": 2322
                }
            }
        }
    },
    "重庆市": {
        "val": 2323,
        "items": {
            "重庆市": {
                "val": 2324,
                "items": {
                    "万州区": 2325,
                    "涪陵区": 2326,
                    "渝中区": 2327,
                    "大渡口区": 2328,
                    "江北区": 2329,
                    "沙坪坝区": 2330,
                    "九龙坡区": 2331,
                    "南岸区": 2332,
                    "北碚区": 2333,
                    "綦江区": 2334,
                    "大足区": 2335,
                    "渝北区": 2336,
                    "巴南区": 2337,
                    "黔江区": 2338,
                    "长寿区": 2339,
                    "江津区": 2340,
                    "合川区": 2341,
                    "永川区": 2342,
                    "南川区": 2343,
                    "璧山区": 2344,
                    "铜梁区": 2345,
                    "潼南县": 2346,
                    "荣昌县": 2347,
                    "梁平县": 2348,
                    "城口县": 2349,
                    "丰都县": 2350,
                    "垫江县": 2351,
                    "武隆县": 2352,
                    "忠县": 2353,
                    "开县": 2354,
                    "云阳县": 2355,
                    "奉节县": 2356,
                    "巫山县": 2357,
                    "巫溪县": 2358,
                    "石柱土家族自治县": 2359,
                    "秀山土家族苗族自治县": 2360,
                    "酉阳土家族苗族自治县": 2361,
                    "彭水苗族土家族自治县": 2362
                }
            },
            "两江新区": {
                "val": 2363,
                "items": {
                    "北部新区": 2364,
                    "保税港区": 2365,
                    "工业园区": 2366
                }
            }
        }
    },
    "四川省": {
        "val": 2367,
        "items": {
            "成都市": {
                "val": 2368,
                "items": {
                    "锦江区": 2369,
                    "青羊区": 2370,
                    "金牛区": 2371,
                    "武侯区": 2372,
                    "成华区": 2373,
                    "龙泉驿区": 2374,
                    "青白江区": 2375,
                    "新都区": 2376,
                    "温江区": 2377,
                    "金堂县": 2378,
                    "双流县": 2379,
                    "郫县": 2380,
                    "大邑县": 2381,
                    "蒲江县": 2382,
                    "新津县": 2383,
                    "都江堰市": 2384,
                    "彭州市": 2385,
                    "邛崃市": 2386,
                    "崇州市": 2387
                }
            },
            "自贡市": {
                "val": 2388,
                "items": {
                    "自流井区": 2389,
                    "贡井区": 2390,
                    "大安区": 2391,
                    "沿滩区": 2392,
                    "荣县": 2393,
                    "富顺县": 2394
                }
            },
            "攀枝花市": {
                "val": 2395,
                "items": {
                    "东区": 2396,
                    "西区": 2397,
                    "仁和区": 2398,
                    "米易县": 2399,
                    "盐边县": 2400
                }
            },
            "泸州市": {
                "val": 2401,
                "items": {
                    "江阳区": 2402,
                    "纳溪区": 2403,
                    "龙马潭区": 2404,
                    "泸县": 2405,
                    "合江县": 2406,
                    "叙永县": 2407,
                    "古蔺县": 2408
                }
            },
            "德阳市": {
                "val": 2409,
                "items": {
                    "旌阳区": 2410,
                    "中江县": 2411,
                    "罗江县": 2412,
                    "广汉市": 2413,
                    "什邡市": 2414,
                    "绵竹市": 2415
                }
            },
            "绵阳市": {
                "val": 2416,
                "items": {
                    "涪城区": 2417,
                    "游仙区": 2418,
                    "三台县": 2419,
                    "盐亭县": 2420,
                    "安县": 2421,
                    "梓潼县": 2422,
                    "北川羌族自治县": 2423,
                    "平武县": 2424,
                    "江油市": 2425
                }
            },
            "广元市": {
                "val": 2426,
                "items": {
                    "利州区": 2427,
                    "昭化区": 2428,
                    "朝天区": 2429,
                    "旺苍县": 2430,
                    "青川县": 2431,
                    "剑阁县": 2432,
                    "苍溪县": 2433
                }
            },
            "遂宁市": {
                "val": 2434,
                "items": {
                    "船山区": 2435,
                    "安居区": 2436,
                    "蓬溪县": 2437,
                    "射洪县": 2438,
                    "大英县": 2439
                }
            },
            "内江市": {
                "val": 2440,
                "items": {
                    "市中区": 2441,
                    "东兴区": 2442,
                    "威远县": 2443,
                    "资中县": 2444,
                    "隆昌县": 2445
                }
            },
            "乐山市": {
                "val": 2446,
                "items": {
                    "市中区": 2447,
                    "沙湾区": 2448,
                    "五通桥区": 2449,
                    "金口河区": 2450,
                    "犍为县": 2451,
                    "井研县": 2452,
                    "夹江县": 2453,
                    "沐川县": 2454,
                    "峨边彝族自治县": 2455,
                    "马边彝族自治县": 2456,
                    "峨眉山市": 2457
                }
            },
            "南充市": {
                "val": 2458,
                "items": {
                    "顺庆区": 2459,
                    "高坪区": 2460,
                    "嘉陵区": 2461,
                    "南部县": 2462,
                    "营山县": 2463,
                    "蓬安县": 2464,
                    "仪陇县": 2465,
                    "西充县": 2466,
                    "阆中市": 2467
                }
            },
            "眉山市": {
                "val": 2468,
                "items": {
                    "东坡区": 2469,
                    "彭山区": 2470,
                    "仁寿县": 2471,
                    "洪雅县": 2472,
                    "丹棱县": 2473,
                    "青神县": 2474
                }
            },
            "宜宾市": {
                "val": 2475,
                "items": {
                    "翠屏区": 2476,
                    "南溪区": 2477,
                    "宜宾县": 2478,
                    "江安县": 2479,
                    "长宁县": 2480,
                    "高县": 2481,
                    "珙县": 2482,
                    "筠连县": 2483,
                    "兴文县": 2484,
                    "屏山县": 2485
                }
            },
            "广安市": {
                "val": 2486,
                "items": {
                    "广安区": 2487,
                    "前锋区": 2488,
                    "岳池县": 2489,
                    "武胜县": 2490,
                    "邻水县": 2491,
                    "华蓥市": 2492
                }
            },
            "达州市": {
                "val": 2493,
                "items": {
                    "通川区": 2494,
                    "达川区": 2495,
                    "宣汉县": 2496,
                    "开江县": 2497,
                    "大竹县": 2498,
                    "渠县": 2499,
                    "万源市": 2500
                }
            },
            "雅安市": {
                "val": 2501,
                "items": {
                    "雨城区": 2502,
                    "名山区": 2503,
                    "荥经县": 2504,
                    "汉源县": 2505,
                    "石棉县": 2506,
                    "天全县": 2507,
                    "芦山县": 2508,
                    "宝兴县": 2509
                }
            },
            "巴中市": {
                "val": 2510,
                "items": {
                    "巴州区": 2511,
                    "恩阳区": 2512,
                    "通江县": 2513,
                    "南江县": 2514,
                    "平昌县": 2515
                }
            },
            "资阳市": {
                "val": 2516,
                "items": {
                    "雁江区": 2517,
                    "安岳县": 2518,
                    "乐至县": 2519,
                    "简阳市": 2520
                }
            },
            "阿坝藏族羌族自治州": {
                "val": 2521,
                "items": {
                    "汶川县": 2522,
                    "理县": 2523,
                    "茂县": 2524,
                    "松潘县": 2525,
                    "九寨沟县": 2526,
                    "金川县": 2527,
                    "小金县": 2528,
                    "黑水县": 2529,
                    "马尔康县": 2530,
                    "壤塘县": 2531,
                    "阿坝县": 2532,
                    "若尔盖县": 2533,
                    "红原县": 2534
                }
            },
            "甘孜藏族自治州": {
                "val": 2535,
                "items": {
                    "康定县": 2536,
                    "泸定县": 2537,
                    "丹巴县": 2538,
                    "九龙县": 2539,
                    "雅江县": 2540,
                    "道孚县": 2541,
                    "炉霍县": 2542,
                    "甘孜县": 2543,
                    "新龙县": 2544,
                    "德格县": 2545,
                    "白玉县": 2546,
                    "石渠县": 2547,
                    "色达县": 2548,
                    "理塘县": 2549,
                    "巴塘县": 2550,
                    "乡城县": 2551,
                    "稻城县": 2552,
                    "得荣县": 2553
                }
            },
            "凉山彝族自治州": {
                "val": 2554,
                "items": {
                    "西昌市": 2555,
                    "木里藏族自治县": 2556,
                    "盐源县": 2557,
                    "德昌县": 2558,
                    "会理县": 2559,
                    "会东县": 2560,
                    "宁南县": 2561,
                    "普格县": 2562,
                    "布拖县": 2563,
                    "金阳县": 2564,
                    "昭觉县": 2565,
                    "喜德县": 2566,
                    "冕宁县": 2567,
                    "越西县": 2568,
                    "甘洛县": 2569,
                    "美姑县": 2570,
                    "雷波县": 2571
                }
            }
        }
    },
    "贵州省": {
        "val": 2572,
        "items": {
            "贵阳市": {
                "val": 2573,
                "items": {
                    "南明区": 2574,
                    "云岩区": 2575,
                    "花溪区": 2576,
                    "乌当区": 2577,
                    "白云区": 2578,
                    "观山湖区": 2579,
                    "开阳县": 2580,
                    "息烽县": 2581,
                    "修文县": 2582,
                    "清镇市": 2583
                }
            },
            "六盘水市": {
                "val": 2584,
                "items": {
                    "钟山区": 2585,
                    "六枝特区": 2586,
                    "水城县": 2587,
                    "盘县": 2588
                }
            },
            "遵义市": {
                "val": 2589,
                "items": {
                    "红花岗区": 2590,
                    "汇川区": 2591,
                    "遵义县": 2592,
                    "桐梓县": 2593,
                    "绥阳县": 2594,
                    "正安县": 2595,
                    "道真仡佬族苗族自治县": 2596,
                    "务川仡佬族苗族自治县": 2597,
                    "凤冈县": 2598,
                    "湄潭县": 2599,
                    "余庆县": 2600,
                    "习水县": 2601,
                    "赤水市": 2602,
                    "仁怀市": 2603
                }
            },
            "安顺市": {
                "val": 2604,
                "items": {
                    "西秀区": 2605,
                    "平坝区": 2606,
                    "普定县": 2607,
                    "镇宁布依族苗族自治县": 2608,
                    "关岭布依族苗族自治县": 2609,
                    "紫云苗族布依族自治县": 2610
                }
            },
            "毕节市": {
                "val": 2611,
                "items": {
                    "七星关区": 2612,
                    "大方县": 2613,
                    "黔西县": 2614,
                    "金沙县": 2615,
                    "织金县": 2616,
                    "纳雍县": 2617,
                    "威宁彝族回族苗族自治县": 2618,
                    "赫章县": 2619
                }
            },
            "铜仁市": {
                "val": 2620,
                "items": {
                    "碧江区": 2621,
                    "万山区": 2622,
                    "江口县": 2623,
                    "玉屏侗族自治县": 2624,
                    "石阡县": 2625,
                    "思南县": 2626,
                    "印江土家族苗族自治县": 2627,
                    "德江县": 2628,
                    "沿河土家族自治县": 2629,
                    "松桃苗族自治县": 2630
                }
            },
            "黔西南布依族苗族自治州": {
                "val": 2631,
                "items": {
                    "兴义市 ": 2632,
                    "兴仁县": 2633,
                    "普安县": 2634,
                    "晴隆县": 2635,
                    "贞丰县": 2636,
                    "望谟县": 2637,
                    "册亨县": 2638,
                    "安龙县": 2639
                }
            },
            "黔东南苗族侗族自治州": {
                "val": 2640,
                "items": {
                    "凯里市": 2641,
                    "黄平县": 2642,
                    "施秉县": 2643,
                    "三穗县": 2644,
                    "镇远县": 2645,
                    "岑巩县": 2646,
                    "天柱县": 2647,
                    "锦屏县": 2648,
                    "剑河县": 2649,
                    "台江县": 2650,
                    "黎平县": 2651,
                    "榕江县": 2652,
                    "从江县": 2653,
                    "雷山县": 2654,
                    "麻江县": 2655,
                    "丹寨县": 2656
                }
            },
            "黔南布依族苗族自治州": {
                "val": 2657,
                "items": {
                    "都匀市": 2658,
                    "福泉市": 2659,
                    "荔波县": 2660,
                    "贵定县": 2661,
                    "瓮安县": 2662,
                    "独山县": 2663,
                    "平塘县": 2664,
                    "罗甸县": 2665,
                    "长顺县": 2666,
                    "龙里县": 2667,
                    "惠水县": 2668,
                    "三都水族自治县": 2669
                }
            }
        }
    },
    "云南省": {
        "val": 2670,
        "items": {
            "昆明市": {
                "val": 2671,
                "items": {
                    "五华区": 2672,
                    "盘龙区": 2673,
                    "官渡区": 2674,
                    "西山区": 2675,
                    "东川区": 2676,
                    "呈贡区": 2677,
                    "晋宁县": 2678,
                    "富民县": 2679,
                    "宜良县": 2680,
                    "石林彝族自治县": 2681,
                    "嵩明县": 2682,
                    "禄劝彝族苗族自治县": 2683,
                    "寻甸回族彝族自治县 ": 2684,
                    "安宁市": 2685
                }
            },
            "曲靖市": {
                "val": 2686,
                "items": {
                    "麒麟区": 2687,
                    "马龙县": 2688,
                    "陆良县": 2689,
                    "师宗县": 2690,
                    "罗平县": 2691,
                    "富源县": 2692,
                    "会泽县": 2693,
                    "沾益县": 2694,
                    "宣威市": 2695
                }
            },
            "玉溪市": {
                "val": 2696,
                "items": {
                    "红塔区": 2697,
                    "江川县": 2698,
                    "澄江县": 2699,
                    "通海县": 2700,
                    "华宁县": 2701,
                    "易门县": 2702,
                    "峨山彝族自治县": 2703,
                    "新平彝族傣族自治县": 2704,
                    "元江哈尼族彝族傣族自治县": 2705
                }
            },
            "保山市": {
                "val": 2706,
                "items": {
                    "隆阳区": 2707,
                    "施甸县": 2708,
                    "腾冲县": 2709,
                    "龙陵县": 2710,
                    "昌宁县": 2711
                }
            },
            "昭通市": {
                "val": 2712,
                "items": {
                    "昭阳区": 2713,
                    "鲁甸县": 2714,
                    "巧家县": 2715,
                    "盐津县": 2716,
                    "大关县": 2717,
                    "永善县": 2718,
                    "绥江县": 2719,
                    "镇雄县": 2720,
                    "彝良县": 2721,
                    "威信县": 2722,
                    "水富县": 2723
                }
            },
            "丽江市": {
                "val": 2724,
                "items": {
                    "古城区": 2725,
                    "玉龙纳西族自治县": 2726,
                    "永胜县": 2727,
                    "华坪县": 2728,
                    "宁蒗彝族自治县": 2729
                }
            },
            "普洱市": {
                "val": 2730,
                "items": {
                    "思茅区": 2731,
                    "宁洱哈尼族彝族自治县": 2732,
                    "墨江哈尼族自治县": 2733,
                    "景东彝族自治县": 2734,
                    "景谷傣族彝族自治县": 2735,
                    "镇沅彝族哈尼族拉祜族自治县": 2736,
                    "江城哈尼族彝族自治县": 2737,
                    "孟连傣族拉祜族佤族自治县": 2738,
                    "澜沧拉祜族自治县": 2739,
                    "西盟佤族自治县": 2740
                }
            },
            "临沧市": {
                "val": 2741,
                "items": {
                    "临翔区": 2742,
                    "凤庆县": 2743,
                    "云县": 2744,
                    "永德县": 2745,
                    "镇康县": 2746,
                    "双江拉祜族佤族布朗族傣族自治县": 2747,
                    "耿马傣族佤族自治县": 2748,
                    "沧源佤族自治县": 2749
                }
            },
            "楚雄彝族自治州": {
                "val": 2750,
                "items": {
                    "楚雄市": 2751,
                    "双柏县": 2752,
                    "牟定县": 2753,
                    "南华县": 2754,
                    "姚安县": 2755,
                    "大姚县": 2756,
                    "永仁县": 2757,
                    "元谋县": 2758,
                    "武定县": 2759,
                    "禄丰县": 2760
                }
            },
            "红河哈尼族彝族自治州": {
                "val": 2761,
                "items": {
                    "个旧市": 2762,
                    "开远市": 2763,
                    "蒙自市": 2764,
                    "弥勒市": 2765,
                    "屏边苗族自治县": 2766,
                    "建水县": 2767,
                    "石屏县": 2768,
                    "泸西县": 2769,
                    "元阳县": 2770,
                    "红河县": 2771,
                    "金平苗族瑶族傣族自治县": 2772,
                    "绿春县": 2773,
                    "河口瑶族自治县": 2774
                }
            },
            "文山壮族苗族自治州": {
                "val": 2775,
                "items": {
                    "文山市": 2776,
                    "砚山县": 2777,
                    "西畴县": 2778,
                    "麻栗坡县": 2779,
                    "马关县": 2780,
                    "丘北县": 2781,
                    "广南县": 2782,
                    "富宁县": 2783
                }
            },
            "西双版纳傣族自治州": {
                "val": 2784,
                "items": {
                    "景洪市": 2785,
                    "勐海县": 2786,
                    "勐腊县": 2787
                }
            },
            "大理白族自治州": {
                "val": 2788,
                "items": {
                    "大理市": 2789,
                    "漾濞彝族自治县": 2790,
                    "祥云县": 2791,
                    "宾川县": 2792,
                    "弥渡县": 2793,
                    "南涧彝族自治县": 2794,
                    "巍山彝族回族自治县": 2795,
                    "永平县": 2796,
                    "云龙县": 2797,
                    "洱源县": 2798,
                    "剑川县": 2799,
                    "鹤庆县": 2800
                }
            },
            "德宏傣族景颇族自治州": {
                "val": 2801,
                "items": {
                    "瑞丽市": 2802,
                    "芒市": 2803,
                    "梁河县": 2804,
                    "盈江县": 2805,
                    "陇川县": 2806
                }
            },
            "怒江傈僳族自治州": {
                "val": 2807,
                "items": {
                    "泸水县": 2808,
                    "福贡县": 2809,
                    "贡山独龙族怒族自治县": 2810,
                    "兰坪白族普米族自治县": 2811
                }
            },
            "迪庆藏族自治州": {
                "val": 2812,
                "items": {
                    "香格里拉市": 2813,
                    "德钦县": 2814,
                    "维西傈僳族自治县": 2815
                }
            }
        }
    },
    "西藏自治区": {
        "val": 2816,
        "items": {
            "拉萨市": {
                "val": 2817,
                "items": {
                    "城关区": 2818,
                    "林周县": 2819,
                    "当雄县": 2820,
                    "尼木县": 2821,
                    "曲水县": 2822,
                    "堆龙德庆县": 2823,
                    "达孜县": 2824,
                    "墨竹工卡县": 2825
                }
            },
            "日喀则市": {
                "val": 2826,
                "items": {
                    "桑珠孜区": 2827,
                    "南木林县": 2828,
                    "江孜县": 2829,
                    "定日县": 2830,
                    "萨迦县": 2831,
                    "拉孜县": 2832,
                    "昂仁县": 2833,
                    "谢通门县": 2834,
                    "白朗县": 2835,
                    "仁布县": 2836,
                    "康马县": 2837,
                    "定结县": 2838,
                    "仲巴县": 2839,
                    "亚东县": 2840,
                    "吉隆县": 2841,
                    "聂拉木县": 2842,
                    "萨嘎县": 2843,
                    "岗巴县": 2844
                }
            },
            "昌都市": {
                "val": 2845,
                "items": {
                    "卡若区": 2846,
                    "江达县": 2847,
                    "贡觉县": 2848,
                    "类乌齐县": 2849,
                    "丁青县": 2850,
                    "察雅县": 2851,
                    "八宿县": 2852,
                    "左贡县": 2853,
                    "芒康县": 2854,
                    "洛隆县": 2855,
                    "边坝县": 2856
                }
            },
            "山南地区": {
                "val": 2857,
                "items": {
                    "乃东县": 2858,
                    "扎囊县": 2859,
                    "贡嘎县": 2860,
                    "桑日县": 2861,
                    "琼结县": 2862,
                    "曲松县": 2863,
                    "措美县": 2864,
                    "洛扎县": 2865,
                    "加查县": 2866,
                    "隆子县": 2867,
                    "错那县": 2868,
                    "浪卡子县": 2869
                }
            },
            "那曲地区": {
                "val": 2870,
                "items": {
                    "那曲县": 2871,
                    "嘉黎县": 2872,
                    "比如县": 2873,
                    "聂荣县": 2874,
                    "安多县": 2875,
                    "申扎县": 2876,
                    "索县": 2877,
                    "班戈县": 2878,
                    "巴青县": 2879,
                    "尼玛县": 2880,
                    "双湖县": 2881
                }
            },
            "阿里地区": {
                "val": 2882,
                "items": {
                    "普兰县": 2883,
                    "札达县": 2884,
                    "噶尔县": 2885,
                    "日土县": 2886,
                    "革吉县": 2887,
                    "改则县": 2888,
                    "措勤县": 2889
                }
            },
            "林芝地区": {
                "val": 2890,
                "items": {
                    "林芝县": 2891,
                    "工布江达县": 2892,
                    "米林县": 2893,
                    "墨脱县": 2894,
                    "波密县": 2895,
                    "察隅县": 2896,
                    "朗县": 2897
                }
            }
        }
    },
    "陕西省": {
        "val": 2898,
        "items": {
            "西安市": {
                "val": 2899,
                "items": {
                    "新城区": 2900,
                    "碑林区": 2901,
                    "莲湖区": 2902,
                    "灞桥区": 2903,
                    "未央区": 2904,
                    "雁塔区": 2905,
                    "阎良区": 2906,
                    "临潼区": 2907,
                    "长安区": 2908,
                    "蓝田县": 2909,
                    "周至县": 2910,
                    "户县": 2911,
                    "高陵区": 2912
                }
            },
            "铜川市": {
                "val": 2913,
                "items": {
                    "王益区": 2914,
                    "印台区": 2915,
                    "耀州区": 2916,
                    "宜君县": 2917
                }
            },
            "宝鸡市": {
                "val": 2918,
                "items": {
                    "渭滨区": 2919,
                    "金台区": 2920,
                    "陈仓区": 2921,
                    "凤翔县": 2922,
                    "岐山县": 2923,
                    "扶风县": 2924,
                    "眉县": 2925,
                    "陇县": 2926,
                    "千阳县": 2927,
                    "麟游县": 2928,
                    "凤县": 2929,
                    "太白县": 2930
                }
            },
            "咸阳市": {
                "val": 2931,
                "items": {
                    "秦都区": 2932,
                    "杨陵区": 2933,
                    "渭城区": 2934,
                    "三原县": 2935,
                    "泾阳县": 2936,
                    "乾县": 2937,
                    "礼泉县": 2938,
                    "永寿县": 2939,
                    "彬县": 2940,
                    "长武县": 2941,
                    "旬邑县": 2942,
                    "淳化县": 2943,
                    "武功县": 2944,
                    "兴平市": 2945
                }
            },
            "渭南市": {
                "val": 2946,
                "items": {
                    "临渭区": 2947,
                    "华县": 2948,
                    "潼关县": 2949,
                    "大荔县": 2950,
                    "合阳县": 2951,
                    "澄城县": 2952,
                    "蒲城县": 2953,
                    "白水县": 2954,
                    "富平县": 2955,
                    "韩城市": 2956,
                    "华阴市": 2957
                }
            },
            "延安市": {
                "val": 2958,
                "items": {
                    "宝塔区": 2959,
                    "延长县": 2960,
                    "延川县": 2961,
                    "子长县": 2962,
                    "安塞县": 2963,
                    "志丹县": 2964,
                    "吴起县": 2965,
                    "甘泉县": 2966,
                    "富县": 2967,
                    "洛川县": 2968,
                    "宜川县": 2969,
                    "黄龙县": 2970,
                    "黄陵县": 2971
                }
            },
            "汉中市": {
                "val": 2972,
                "items": {
                    "汉台区": 2973,
                    "南郑县": 2974,
                    "城固县": 2975,
                    "洋县": 2976,
                    "西乡县": 2977,
                    "勉县": 2978,
                    "宁强县": 2979,
                    "略阳县": 2980,
                    "镇巴县": 2981,
                    "留坝县": 2982,
                    "佛坪县": 2983
                }
            },
            "榆林市": {
                "val": 2984,
                "items": {
                    "榆阳区": 2985,
                    "神木县": 2986,
                    "府谷县": 2987,
                    "横山县": 2988,
                    "靖边县": 2989,
                    "定边县": 2990,
                    "绥德县": 2991,
                    "米脂县": 2992,
                    "佳县": 2993,
                    "吴堡县": 2994,
                    "清涧县": 2995,
                    "子洲县": 2996
                }
            },
            "安康市": {
                "val": 2997,
                "items": {
                    "汉滨区": 2998,
                    "汉阴县": 2999,
                    "石泉县": 3000,
                    "宁陕县": 3001,
                    "紫阳县": 3002,
                    "岚皋县": 3003,
                    "平利县": 3004,
                    "镇坪县": 3005,
                    "旬阳县": 3006,
                    "白河县": 3007
                }
            },
            "商洛市": {
                "val": 3008,
                "items": {
                    "商州区": 3009,
                    "洛南县": 3010,
                    "丹凤县": 3011,
                    "商南县": 3012,
                    "山阳县": 3013,
                    "镇安县": 3014,
                    "柞水县": 3015
                }
            },
            "西咸新区": {
                "val": 3016,
                "items": {
                    "空港新城": 3017,
                    "沣东新城": 3018,
                    "秦汉新城": 3019,
                    "沣西新城": 3020,
                    "泾河新城": 3021
                }
            }
        }
    },
    "甘肃省": {
        "val": 3022,
        "items": {
            "兰州市": {
                "val": 3023,
                "items": {
                    "城关区": 3024,
                    "七里河区": 3025,
                    "西固区": 3026,
                    "安宁区": 3027,
                    "红古区": 3028,
                    "永登县": 3029,
                    "皋兰县": 3030,
                    "榆中县": 3031
                }
            },
            "嘉峪关市": {
                "val": 3032,
                "items": {
                    "雄关区": 3033,
                    "长城区": 3034,
                    "镜铁区": 3035
                }
            },
            "金昌市": {
                "val": 3036,
                "items": {
                    "金川区": 3037,
                    "永昌县": 3038
                }
            },
            "白银市": {
                "val": 3039,
                "items": {
                    "白银区": 3040,
                    "平川区": 3041,
                    "靖远县": 3042,
                    "会宁县": 3043,
                    "景泰县": 3044
                }
            },
            "天水市": {
                "val": 3045,
                "items": {
                    "秦州区": 3046,
                    "麦积区": 3047,
                    "清水县": 3048,
                    "秦安县": 3049,
                    "甘谷县": 3050,
                    "武山县": 3051,
                    "张家川回族自治县": 3052
                }
            },
            "武威市": {
                "val": 3053,
                "items": {
                    "凉州区": 3054,
                    "民勤县": 3055,
                    "古浪县": 3056,
                    "天祝藏族自治县": 3057
                }
            },
            "张掖市": {
                "val": 3058,
                "items": {
                    "甘州区": 3059,
                    "肃南裕固族自治县": 3060,
                    "民乐县": 3061,
                    "临泽县": 3062,
                    "高台县": 3063,
                    "山丹县": 3064
                }
            },
            "平凉市": {
                "val": 3065,
                "items": {
                    "崆峒区": 3066,
                    "泾川县": 3067,
                    "灵台县": 3068,
                    "崇信县": 3069,
                    "华亭县": 3070,
                    "庄浪县": 3071,
                    "静宁县": 3072
                }
            },
            "酒泉市": {
                "val": 3073,
                "items": {
                    "肃州区": 3074,
                    "金塔县": 3075,
                    "瓜州县": 3076,
                    "肃北蒙古族自治县": 3077,
                    "阿克塞哈萨克族自治县": 3078,
                    "玉门市": 3079,
                    "敦煌市": 3080
                }
            },
            "庆阳市": {
                "val": 3081,
                "items": {
                    "西峰区": 3082,
                    "庆城县": 3083,
                    "环县": 3084,
                    "华池县": 3085,
                    "合水县": 3086,
                    "正宁县": 3087,
                    "宁县": 3088,
                    "镇原县": 3089
                }
            },
            "定西市": {
                "val": 3090,
                "items": {
                    "安定区": 3091,
                    "通渭县": 3092,
                    "陇西县": 3093,
                    "渭源县": 3094,
                    "临洮县": 3095,
                    "漳县": 3096,
                    "岷县": 3097
                }
            },
            "陇南市": {
                "val": 3098,
                "items": {
                    "武都区": 3099,
                    "成县": 3100,
                    "文县": 3101,
                    "宕昌县": 3102,
                    "康县": 3103,
                    "西和县": 3104,
                    "礼县": 3105,
                    "徽县": 3106,
                    "两当县": 3107
                }
            },
            "临夏回族自治州": {
                "val": 3108,
                "items": {
                    "临夏市": 3109,
                    "临夏县": 3110,
                    "康乐县": 3111,
                    "永靖县": 3112,
                    "广河县": 3113,
                    "和政县": 3114,
                    "东乡族自治县": 3115,
                    "积石山保安族东乡族撒拉族自治县": 3116
                }
            },
            "甘南藏族自治州": {
                "val": 3117,
                "items": {
                    "合作市": 3118,
                    "临潭县": 3119,
                    "卓尼县": 3120,
                    "舟曲县": 3121,
                    "迭部县": 3122,
                    "玛曲县": 3123,
                    "碌曲县": 3124,
                    "夏河县": 3125
                }
            }
        }
    },
    "青海省": {
        "val": 3126,
        "items": {
            "西宁市": {
                "val": 3127,
                "items": {
                    "城东区": 3128,
                    "城中区": 3129,
                    "城西区": 3130,
                    "城北区": 3131,
                    "大通回族土族自治县": 3132,
                    "湟中县": 3133,
                    "湟源县": 3134
                }
            },
            "海东市": {
                "val": 3135,
                "items": {
                    "乐都区": 3136,
                    "平安县": 3137,
                    "民和回族土族自治县": 3138,
                    "互助土族自治县": 3139,
                    "化隆回族自治县": 3140,
                    "循化撒拉族自治县": 3141
                }
            },
            "海北藏族自治州": {
                "val": 3142,
                "items": {
                    "门源回族自治县": 3143,
                    "祁连县": 3144,
                    "海晏县": 3145,
                    "刚察县": 3146
                }
            },
            "黄南藏族自治州": {
                "val": 3147,
                "items": {
                    "同仁县": 3148,
                    "尖扎县": 3149,
                    "泽库县": 3150,
                    "河南蒙古族自治县": 3151
                }
            },
            "海南藏族自治州": {
                "val": 3152,
                "items": {
                    "共和县": 3153,
                    "同德县": 3154,
                    "贵德县": 3155,
                    "兴海县": 3156,
                    "贵南县": 3157
                }
            },
            "果洛藏族自治州": {
                "val": 3158,
                "items": {
                    "玛沁县": 3159,
                    "班玛县": 3160,
                    "甘德县": 3161,
                    "达日县": 3162,
                    "久治县": 3163,
                    "玛多县": 3164
                }
            },
            "玉树藏族自治州": {
                "val": 3165,
                "items": {
                    "玉树市": 3166,
                    "杂多县": 3167,
                    "称多县": 3168,
                    "治多县": 3169,
                    "囊谦县": 3170,
                    "曲麻莱县": 3171
                }
            },
            "海西蒙古族藏族自治州": {
                "val": 3172,
                "items": {
                    "格尔木市": 3173,
                    "德令哈市": 3174,
                    "乌兰县": 3175,
                    "都兰县": 3176,
                    "天峻县": 3177
                }
            }
        }
    },
    "宁夏回族自治区": {
        "val": 3178,
        "items": {
            "银川市": {
                "val": 3179,
                "items": {
                    "兴庆区": 3180,
                    "西夏区": 3181,
                    "金凤区": 3182,
                    "永宁县": 3183,
                    "贺兰县": 3184,
                    "灵武市": 3185
                }
            },
            "石嘴山市": {
                "val": 3186,
                "items": {
                    "大武口区": 3187,
                    "惠农区": 3188,
                    "平罗县": 3189
                }
            },
            "吴忠市": {
                "val": 3190,
                "items": {
                    "利通区": 3191,
                    "红寺堡区": 3192,
                    "盐池县": 3193,
                    "同心县": 3194,
                    "青铜峡市": 3195
                }
            },
            "固原市": {
                "val": 3196,
                "items": {
                    "原州区": 3197,
                    "西吉县": 3198,
                    "隆德县": 3199,
                    "泾源县": 3200,
                    "彭阳县": 3201
                }
            },
            "中卫市": {
                "val": 3202,
                "items": {
                    "沙坡头区": 3203,
                    "中宁县": 3204,
                    "海原县": 3205
                }
            }
        }
    },
    "新疆维吾尔自治区": {
        "val": 3206,
        "items": {
            "乌鲁木齐市": {
                "val": 3207,
                "items": {
                    "天山区": 3208,
                    "沙依巴克区": 3209,
                    "新市区": 3210,
                    "水磨沟区": 3211,
                    "头屯河区": 3212,
                    "达坂城区": 3213,
                    "米东区": 3214,
                    "乌鲁木齐县": 3215
                }
            },
            "克拉玛依市": {
                "val": 3216,
                "items": {
                    "独山子区": 3217,
                    "克拉玛依区": 3218,
                    "白碱滩区": 3219,
                    "乌尔禾区": 3220
                }
            },
            "吐鲁番地区": {
                "val": 3221,
                "items": {
                    "吐鲁番市": 3222,
                    "鄯善县": 3223,
                    "托克逊县": 3224
                }
            },
            "哈密地区": {
                "val": 3225,
                "items": {
                    "哈密市": 3226,
                    "巴里坤哈萨克自治县": 3227,
                    "伊吾县": 3228
                }
            },
            "昌吉回族自治州": {
                "val": 3229,
                "items": {
                    "昌吉市": 3230,
                    "阜康市": 3231,
                    "呼图壁县": 3232,
                    "玛纳斯县": 3233,
                    "奇台县": 3234,
                    "吉木萨尔县": 3235,
                    "木垒哈萨克自治县": 3236
                }
            },
            "博尔塔拉蒙古自治州": {
                "val": 3237,
                "items": {
                    "博乐市": 3238,
                    "阿拉山口市": 3239,
                    "精河县": 3240,
                    "温泉县": 3241
                }
            },
            "巴音郭楞蒙古自治州": {
                "val": 3242,
                "items": {
                    "库尔勒市": 3243,
                    "轮台县": 3244,
                    "尉犁县": 3245,
                    "若羌县": 3246,
                    "且末县": 3247,
                    "焉耆回族自治县": 3248,
                    "和静县": 3249,
                    "和硕县": 3250,
                    "博湖县": 3251
                }
            },
            "阿克苏地区": {
                "val": 3252,
                "items": {
                    "阿克苏市": 3253,
                    "温宿县": 3254,
                    "库车县": 3255,
                    "沙雅县": 3256,
                    "新和县": 3257,
                    "拜城县": 3258,
                    "乌什县": 3259,
                    "阿瓦提县": 3260,
                    "柯坪县": 3261
                }
            },
            "克孜勒苏柯尔克孜自治州": {
                "val": 3262,
                "items": {
                    "阿图什市": 3263,
                    "阿克陶县": 3264,
                    "阿合奇县": 3265,
                    "乌恰县": 3266
                }
            },
            "喀什地区": {
                "val": 3267,
                "items": {
                    "喀什市": 3268,
                    "疏附县": 3269,
                    "疏勒县": 3270,
                    "英吉沙县": 3271,
                    "泽普县": 3272,
                    "莎车县": 3273,
                    "叶城县": 3274,
                    "麦盖提县": 3275,
                    "岳普湖县": 3276,
                    "伽师县": 3277,
                    "巴楚县": 3278,
                    "塔什库尔干塔吉克自治县": 3279
                }
            },
            "和田地区": {
                "val": 3280,
                "items": {
                    "和田市": 3281,
                    "和田县": 3282,
                    "墨玉县": 3283,
                    "皮山县": 3284,
                    "洛浦县": 3285,
                    "策勒县": 3286,
                    "于田县": 3287,
                    "民丰县": 3288
                }
            },
            "伊犁哈萨克自治州": {
                "val": 3289,
                "items": {
                    "伊宁市": 3290,
                    "奎屯市": 3291,
                    "霍尔果斯市": 3292,
                    "伊宁县": 3293,
                    "察布查尔锡伯自治县": 3294,
                    "霍城县": 3295,
                    "巩留县": 3296,
                    "新源县": 3297,
                    "昭苏县": 3298,
                    "特克斯县": 3299,
                    "尼勒克县": 3300
                }
            },
            "塔城地区": {
                "val": 3301,
                "items": {
                    "塔城市": 3302,
                    "乌苏市": 3303,
                    "额敏县": 3304,
                    "沙湾县": 3305,
                    "托里县": 3306,
                    "裕民县": 3307,
                    "和布克赛尔蒙古自治县": 3308
                }
            },
            "阿勒泰地区": {
                "val": 3309,
                "items": {
                    "阿勒泰市": 3310,
                    "布尔津县": 3311,
                    "富蕴县": 3312,
                    "福海县": 3313,
                    "哈巴河县": 3314,
                    "青河县": 3315,
                    "吉木乃县": 3316
                }
            },
            "直辖县级": {
                "val": 3317,
                "items": {
                    "石河子市": 3318,
                    "阿拉尔市": 3319,
                    "图木舒克市": 3320,
                    "五家渠市": 3321,
                    "北屯市": 3322,
                    "铁门关市": 3323,
                    "双河市": 3324
                }
            }
        }
    },
    "台湾省": {
        "val": 3325,
        "items": {
            "台北市": {
                "val": 3326,
                "items": {
                    "松山区": 3327,
                    "信义区": 3328,
                    "大安区": 3329,
                    "中山区": 3330,
                    "中正区": 3331,
                    "大同区": 3332,
                    "万华区": 3333,
                    "文山区": 3334,
                    "南港区": 3335,
                    "内湖区": 3336,
                    "士林区": 3337,
                    "北投区": 3338
                }
            },
            "高雄市": {
                "val": 3339,
                "items": {
                    "盐埕区": 3340,
                    "鼓山区": 3341,
                    "左营区": 3342,
                    "楠梓区": 3343,
                    "三民区": 3344,
                    "新兴区": 3345,
                    "前金区": 3346,
                    "苓雅区": 3347,
                    "前镇区": 3348,
                    "旗津区": 3349,
                    "小港区": 3350,
                    "凤山区": 3351,
                    "林园区": 3352,
                    "大寮区": 3353,
                    "大树区": 3354,
                    "大社区": 3355,
                    "仁武区": 3356,
                    "鸟松区": 3357,
                    "冈山区": 3358,
                    "桥头区": 3359,
                    "燕巢区": 3360,
                    "田寮区": 3361,
                    "阿莲区": 3362,
                    "路竹区": 3363,
                    "湖内区": 3364,
                    "茄萣区": 3365,
                    "永安区": 3366,
                    "弥陀区": 3367,
                    "梓官区": 3368,
                    "旗山区": 3369,
                    "美浓区": 3370,
                    "六龟区": 3371,
                    "甲仙区": 3372,
                    "杉林区": 3373,
                    "内门区": 3374,
                    "茂林区": 3375,
                    "桃源区": 3376,
                    "那玛夏区": 3377
                }
            },
            "基隆市": {
                "val": 3378,
                "items": {
                    "中正区": 3379,
                    "七堵区": 3380,
                    "暖暖区": 3381,
                    "仁爱区": 3382,
                    "中山区": 3383,
                    "安乐区": 3384,
                    "信义区": 3385
                }
            },
            "台中市": {
                "val": 3386,
                "items": {
                    "中区": 3387,
                    "东区": 3388,
                    "南区": 3389,
                    "西区": 3390,
                    "北区": 3391,
                    "西屯区": 3392,
                    "南屯区": 3393,
                    "北屯区": 3394,
                    "丰原区": 3395,
                    "东势区": 3396,
                    "大甲区": 3397,
                    "清水区": 3398,
                    "沙鹿区": 3399,
                    "梧栖区": 3400,
                    "后里区": 3401,
                    "神冈区": 3402,
                    "潭子区": 3403,
                    "大雅区": 3404,
                    "新社区": 3405,
                    "石冈区": 3406,
                    "外埔区": 3407,
                    "大安区": 3408,
                    "乌日区": 3409,
                    "大肚区": 3410,
                    "龙井区": 3411,
                    "雾峰区": 3412,
                    "太平区": 3413,
                    "大里区": 3414,
                    "和平区": 3415
                }
            },
            "台南市": {
                "val": 3416,
                "items": {
                    "东区": 3417,
                    "南区": 3418,
                    "北区": 3419,
                    "安南区": 3420,
                    "安平区": 3421,
                    "中西区": 3422,
                    "新营区": 3423,
                    "盐水区": 3424,
                    "白河区": 3425,
                    "柳营区": 3426,
                    "后壁区": 3427,
                    "东山区": 3428,
                    "麻豆区": 3429,
                    "下营区": 3430,
                    "六甲区": 3431,
                    "官田区": 3432,
                    "大内区": 3433,
                    "佳里区": 3434,
                    "学甲区": 3435,
                    "西港区": 3436,
                    "七股区": 3437,
                    "将军区": 3438,
                    "北门区": 3439,
                    "新化区": 3440,
                    "善化区": 3441,
                    "新市区": 3442,
                    "安定区": 3443,
                    "山上区": 3444,
                    "玉井区": 3445,
                    "楠西区": 3446,
                    "南化区": 3447,
                    "左镇区": 3448,
                    "仁德区": 3449,
                    "归仁区": 3450,
                    "关庙区": 3451,
                    "龙崎区": 3452,
                    "永康区": 3453
                }
            },
            "新竹市": {
                "val": 3454,
                "items": {
                    "东区": 3455,
                    "北区": 3456,
                    "香山区": 3457
                }
            },
            "嘉义市": {
                "val": 3458,
                "items": {
                    "东区": 3459,
                    "西区": 3460
                }
            },
            "新北市": {
                "val": 3461,
                "items": {
                    "板桥区": 3462,
                    "三重区": 3463,
                    "中和区": 3464,
                    "永和区": 3465,
                    "新庄区": 3466,
                    "新店区": 3467,
                    "树林区": 3468,
                    "莺歌区": 3469,
                    "三峡区": 3470,
                    "淡水区": 3471,
                    "汐止区": 3472,
                    "瑞芳区": 3473,
                    "土城区": 3474,
                    "芦洲区": 3475,
                    "五股区": 3476,
                    "泰山区": 3477,
                    "林口区": 3478,
                    "深坑区": 3479,
                    "石碇区": 3480,
                    "坪林区": 3481,
                    "三芝区": 3482,
                    "石门区": 3483,
                    "八里区": 3484,
                    "平溪区": 3485,
                    "双溪区": 3486,
                    "贡寮区": 3487,
                    "金山区": 3488,
                    "万里区": 3489,
                    "乌来区": 3490
                }
            },
            "宜兰县": {
                "val": 3491,
                "items": {
                    "宜兰市": 3492,
                    "罗东镇": 3493,
                    "苏澳镇": 3494,
                    "头城镇": 3495,
                    "礁溪乡": 3496,
                    "壮围乡": 3497,
                    "员山乡": 3498,
                    "冬山乡": 3499,
                    "五结乡": 3500,
                    "三星乡": 3501,
                    "大同乡": 3502,
                    "南澳乡": 3503
                }
            },
            "桃园县": {
                "val": 3504,
                "items": {
                    "桃园市": 3505,
                    "中坜市": 3506,
                    "平镇市": 3507,
                    "八德市": 3508,
                    "杨梅市": 3509,
                    "芦竹市": 3510,
                    "大溪镇": 3511,
                    "大园乡": 3512,
                    "龟山乡": 3513,
                    "龙潭乡": 3514,
                    "新屋乡": 3515,
                    "观音乡": 3516,
                    "复兴乡": 3517
                }
            },
            "新竹县": {
                "val": 3518,
                "items": {
                    "竹北市": 3519,
                    "竹东镇": 3520,
                    "新埔镇": 3521,
                    "关西镇": 3522,
                    "湖口乡": 3523,
                    "新丰乡": 3524,
                    "芎林乡": 3525,
                    "横山乡": 3526,
                    "北埔乡": 3527,
                    "宝山乡": 3528,
                    "峨眉乡": 3529,
                    "尖石乡": 3530,
                    "五峰乡": 3531
                }
            },
            "苗栗县": {
                "val": 3532,
                "items": {
                    "苗栗市": 3533,
                    "苑里镇": 3534,
                    "通霄镇": 3535,
                    "竹南镇": 3536,
                    "头份镇": 3537,
                    "后龙镇": 3538,
                    "卓兰镇": 3539,
                    "大湖乡": 3540,
                    "公馆乡": 3541,
                    "铜锣乡": 3542,
                    "南庄乡": 3543,
                    "头屋乡": 3544,
                    "三义乡": 3545,
                    "西湖乡": 3546,
                    "造桥乡": 3547,
                    "三湾乡": 3548,
                    "狮潭乡": 3549,
                    "泰安乡": 3550
                }
            },
            "彰化县": {
                "val": 3551,
                "items": {
                    "彰化市": 3552,
                    "鹿港镇": 3553,
                    "和美镇": 3554,
                    "线西乡": 3555,
                    "伸港乡": 3556,
                    "福兴乡": 3557,
                    "秀水乡": 3558,
                    "花坛乡": 3559,
                    "芬园乡": 3560,
                    "员林镇": 3561,
                    "溪湖镇": 3562,
                    "田中镇": 3563,
                    "大村乡": 3564,
                    "埔盐乡": 3565,
                    "埔心乡": 3566,
                    "永靖乡": 3567,
                    "社头乡": 3568,
                    "二水乡": 3569,
                    "北斗镇": 3570,
                    "二林镇": 3571,
                    "田尾乡": 3572,
                    "埤头乡": 3573,
                    "芳苑乡": 3574,
                    "大城乡": 3575,
                    "竹塘乡": 3576,
                    "溪州乡": 3577
                }
            },
            "南投县": {
                "val": 3578,
                "items": {
                    "南投市": 3579,
                    "埔里镇": 3580,
                    "草屯镇": 3581,
                    "竹山镇": 3582,
                    "集集镇": 3583,
                    "名间乡": 3584,
                    "鹿谷乡": 3585,
                    "中寮乡": 3586,
                    "鱼池乡": 3587,
                    "国姓乡": 3588,
                    "水里乡": 3589,
                    "信义乡": 3590,
                    "仁爱乡": 3591
                }
            },
            "云林县": {
                "val": 3592,
                "items": {
                    "斗六市": 3593,
                    "斗南镇": 3594,
                    "虎尾镇": 3595,
                    "西螺镇": 3596,
                    "土库镇": 3597,
                    "北港镇": 3598,
                    "古坑乡": 3599,
                    "大埤乡": 3600,
                    "莿桐乡": 3601,
                    "林内乡": 3602,
                    "二仑乡": 3603,
                    "仑背乡": 3604,
                    "麦寮乡": 3605,
                    "东势乡": 3606,
                    "褒忠乡": 3607,
                    "台西乡": 3608,
                    "元长乡": 3609,
                    "四湖乡": 3610,
                    "口湖乡": 3611,
                    "水林乡": 3612
                }
            },
            "嘉义县": {
                "val": 3613,
                "items": {
                    "太保市": 3614,
                    "朴子市": 3615,
                    "布袋镇": 3616,
                    "大林镇": 3617,
                    "民雄乡": 3618,
                    "溪口乡": 3619,
                    "新港乡": 3620,
                    "六脚乡": 3621,
                    "东石乡": 3622,
                    "义竹乡": 3623,
                    "鹿草乡": 3624,
                    "水上乡": 3625,
                    "中埔乡": 3626,
                    "竹崎乡": 3627,
                    "梅山乡": 3628,
                    "番路乡": 3629,
                    "大埔乡": 3630,
                    "阿里山乡": 3631
                }
            },
            "屏东县": {
                "val": 3632,
                "items": {
                    "屏东市": 3633,
                    "潮州镇": 3634,
                    "东港镇": 3635,
                    "恒春镇": 3636,
                    "万丹乡": 3637,
                    "长治乡": 3638,
                    "麟洛乡": 3639,
                    "九如乡": 3640,
                    "里港乡": 3641,
                    "盐埔乡": 3642,
                    "高树乡": 3643,
                    "万峦乡": 3644,
                    "内埔乡": 3645,
                    "竹田乡": 3646,
                    "新埤乡": 3647,
                    "枋寮乡": 3648,
                    "新园乡": 3649,
                    "崁顶乡": 3650,
                    "林边乡": 3651,
                    "南州乡": 3652,
                    "佳冬乡": 3653,
                    "琉球乡": 3654,
                    "车城乡": 3655,
                    "满州乡": 3656,
                    "枋山乡": 3657,
                    "三地门乡": 3658,
                    "雾台乡": 3659,
                    "玛家乡": 3660,
                    "泰武乡": 3661,
                    "来义乡": 3662,
                    "春日乡": 3663,
                    "狮子乡": 3664,
                    "牡丹乡": 3665
                }
            },
            "台东县": {
                "val": 3666,
                "items": {
                    "台东市": 3667,
                    "成功镇": 3668,
                    "关山镇": 3669,
                    "卑南乡": 3670,
                    "鹿野乡": 3671,
                    "池上乡": 3672,
                    "东河乡": 3673,
                    "长滨乡": 3674,
                    "太麻里乡": 3675,
                    "大武乡": 3676,
                    "绿岛乡": 3677,
                    "海端乡": 3678,
                    "延平乡": 3679,
                    "金峰乡": 3680,
                    "达仁乡": 3681,
                    "兰屿乡": 3682
                }
            },
            "花莲县": {
                "val": 3683,
                "items": {
                    "花莲市": 3684,
                    "凤林镇": 3685,
                    "玉里镇": 3686,
                    "新城乡": 3687,
                    "吉安乡": 3688,
                    "寿丰乡": 3689,
                    "光复乡": 3690,
                    "丰滨乡": 3691,
                    "瑞穗乡": 3692,
                    "富里乡": 3693,
                    "秀林乡": 3694,
                    "万荣乡": 3695,
                    "卓溪乡": 3696
                }
            },
            "澎湖县": {
                "val": 3697,
                "items": {
                    "马公市": 3698,
                    "湖西乡": 3699,
                    "白沙乡": 3700,
                    "西屿乡": 3701,
                    "望安乡": 3702,
                    "七美乡": 3703
                }
            },
            "金门县": {
                "val": 3704,
                "items": {
                    "金城镇": 3705,
                    "金湖镇": 3706,
                    "金沙镇": 3707,
                    "金宁乡": 3708,
                    "烈屿乡": 3709,
                    "乌丘乡": 3710
                }
            },
            "连江县": {
                "val": 3711,
                "items": {
                    "南竿乡": 3712,
                    "北竿乡": 3713,
                    "莒光乡": 3714,
                    "东引乡": 3715
                }
            }
        }
    },
    "香港特别行政区": {
        "val": 3716,
        "items": {
            "香港岛": {
                "val": 3717,
                "items": {
                    "中西区": 3718,
                    "湾仔区": 3719,
                    "东区": 3720,
                    "南区": 3721
                }
            },
            "九龙": {
                "val": 3722,
                "items": {
                    "油尖旺区": 3723,
                    "深水埗区": 3724,
                    "九龙城区": 3725,
                    "黄大仙区": 3726,
                    "观塘区": 3727
                }
            },
            "新界": {
                "val": 3728,
                "items": {
                    "荃湾区": 3729,
                    "屯门区": 3730,
                    "元朗区": 3731,
                    "北区": 3732,
                    "大埔区": 3733,
                    "西贡区": 3734,
                    "沙田区": 3735,
                    "葵青区": 3736,
                    "离岛区": 3737
                }
            }
        }
    },
    "澳门特别行政区": {
        "val": 3738,
        "items": {
            "澳门半岛": {
                "val": 3739,
                "items": {
                    "花地玛堂区": 3740,
                    "圣安多尼堂区": 3741,
                    "大堂区": 3742,
                    "望德堂区": 3743,
                    "风顺堂区": 3744
                }
            },
            "氹仔岛": {
                "val": 3745,
                "items": {
                    "嘉模堂区": 3746
                }
            },
            "路环岛": {
                "val": 3747,
                "items": {
                    "圣方济各堂区": 3748
                }
            }
        }
    }
};